[
  {
    "title": "Lead Dev Java F/H - 92350 Le Plessis-Robinson - Indeed.com",
    "job_title": "Lead Dev Java F/H",
    "jk": "030294d05c7b0818",
    "company": "MBDA France",
    "location": "92350 Le Plessis-Robinson",
    "canonical": "https://fr.indeed.com/viewjob?jk=030294d05c7b0818",
    "contract": null,
    "description": "Intégrez la direction\nWeapon System\n, responsable de l’ensemble des activités d’ingénierie système pour MBDA.\nVous rejoignez le département\nWeapon Systems Simulation & Experimentation\nqui réalise des simulations de systèmes d'armes (expérimentations avec homme dans la boucle, études et démonstrations de nouveaux concepts, évaluation de la performance).\nVous intégrez une équipe d'une trentaine de personnes, basée au Plessis-Robinson, composée de développeurs logiciels, d'ingénieurs systèmes et de graphistes 3D.\nAu sein du pôle Product Line, vous piloterez et participerez aux développements des frameworks permettant de communaliser et unifier le développement de simulations, simplifier leur réalisation grâce à une architecture commune et proposer des outils pour l'analyse et le post-traitement.\nÊtre Responsable en développement Java, c'est :\nFaire émerger le besoin utilisateur et proposer des solutions innovantes pour y répondre\nParticiper à la construction de la roadmap Ligne Produit\nPiloter et coordonner les travaux réalisés par l’équipe de développement à travers l’élaboration des sprints et rituels Scrum\nDévelopper de nouvelles fonctionnalités et intervenir sur le code existant pour appliquer les correctifs nécessaires\nS'assurer de la qualité technique des projets et contribuer aux bonnes pratiques du département (tests, documentation, intégration continue)\nRéaliser de la veille technologique et être moteur pour faire évoluer l'équipe\nIssu(e) d'une formation Bac+5, vous justifiez d’une\nexpérience minimale de 5 ans\nen développement logiciel.\nVous maitrisez le langage Java et disposez d'une première expérience en coordination d'équipe.\nL’équipe évolue dans l’environnement technique suivant :\nMéthodologie agile : SCRUM\nDéveloppement orienté objet : Java, C++\nOutils de développement : Maven, CMake\nBases de données : MongoDB, PostgreSQL\nOutils DevOps : Docker, Kubernetes\nCompte tenu de l'environnement international de notre société, un bon niveau d'anglais est nécessaire.\nLes défis technologiques de l’industrie de défense vous motivent ? Envoyez-nous votre candidature !\nLes projets que vous réalisez interviennent sur l'ensemble du cycle de vie d’un produit."
  },
  {
    "title": "DÉVELOPPEUR JAVA - 75001 Paris - Indeed.com",
    "job_title": "DÉVELOPPEUR JAVA",
    "jk": "882fc685435b79ef",
    "company": "Meedz",
    "location": "75001 Paris",
    "canonical": "https://fr.indeed.com/viewjob?jk=882fc685435b79ef",
    "contract": null,
    "description": "Expérience : > 2 ans\nPARIS ou LILLE\nCDI\nDescriptif du poste\nL’environnement Java n’a plus aucun secret pour toi ?\nTu attends avec impatience la nouvelle version de Java, Spring ou encore Quarkus ? Tu disposes idéalement de 2 années d’expérience, tu souhaiterais participer à un projet qui a du sens et tu te vois bien apporter une pierre à l’édifice ? Comme mentor, par exemple pour partager tes connaissances, les juniors seront à leur tour les mentors de demain.\nOu comme acteur sur des projets interne, comme par exemple la refonte du site, l’écriture de livre blanc etc.\nEs-tu Meedzer dans l’âme ?\nTu as un amour inconditionnel pour Java et tu es très bon ami avec avec les framework récents.\nLe développement web ça te connaît et tu aimes le style architectural des microservices et du déploiement continu.\nTu testes, déploies, maintiens et améliore une application les yeux fermés.\nTu trouves la méthode très importante. Pour toi, agilité rime avec flexibilité et adaptabilité. Cerise sur le gâteau tu as des bonnes notions en Devops : Docker / Github / Kubernetes.Tu recherches un challenge, tu es motivé à bloc, tu aimes partager et apprendre de tes pairs.\nYou speak English very well.\nLes indispensables d’un développeur chez Meedz\nTu es bien plus qu’un codeur, tu es un développeur et comme chaque bon dev qui se respecte, tu es paresseux.\nTu prends le temps de comprendre ton besoin.\nTu évites de faire des tâches répétitives : coucou l’automatisation.\nQualité rime avec rapidité. Eh oui, tu privilégieras toujours un code de qualité, car cela te fera gagner du temps !\nLa résolution de problème, tu en fais ton affaire et pour ça, tu vois le code comme un moyen d’y arriver et non comme une finalité.\nFashionista, tu te tiens informé continuellement des nouvelles tendances IT.\nComment se passe le processus de recrutement ?\nUne discussion avec un merveilleux RH pour comprendre ce que tu recherches.\nUn échange avec un extraordinaire sales pour te présenter les potentielles missions.\nSi tu le souhaites, tu peux échanger avec l’un des consultants pour en savoir davantage sur le quotidien d’un Meedzeur et sur tes connaissances avec l’un de tes pairs.\nSuite à ça, on te fait une proposition de collaboration pour intégrer notre superbe équipe Évidemment on finit par fêter ça autour d’un verre de bière, coca, jus en fonction de ton bon vouloir\nMeedz œuvre pour l’égalité des chances et valorise la diversité des personnes. Nous souhaitons permettre aux potentiels individuels d’être reconnus, respectés afin de contribuer au dynamisme de notre société."
  },
  {
    "title": "Développeur Full Stack - Paris (75) - Indeed.com",
    "job_title": "Développeur Full Stack",
    "jk": "36d906190f903ef7",
    "company": "BluTech",
    "location": "Paris (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=36d906190f903ef7",
    "contract": null,
    "description": "A propos de BluTech\nFondée en septembre 2018, BluTech est une ESN au service de l’intrapreneuriat. Le but de Matthieu, le fondateur, est de générer les fonds suffisants par le biais de cette activité pour ensuite développer des projets innovants - il souhaite créer un incubateur en quelque sorte. Matthieu a déjà lancé de nouveaux projets cette année - c’est le moment pour rejoindre l’aventure !\nLa vision BluTech\nFaire que les projets soient autofinancés par l’activité de l’ESN sur laquelle les collaborateurs travailleront 70% de leur temps\n30% du temps restant sera dédié à la création de nouveaux projets, en collaboration avec toute l’équipe. Nos collaborateurs de rêve ont une une grande fibre entrepreneuriale et une volonté de co-construire, ensemble !\nLes projets internes envisagés sont divers et variés, tant qu’ils répondent à un besoin du marché ! Cela pourra aller du SaaS, à une application mobile d'entreprise, en passant par une plateforme de transfert de connaissances. Si tu as une idée que tu aimerais développer, ce sera l’occasion rêvée !\nSur la partie ESN, BluTech a une forte valeur ajoutée : la startup propose un accompagnement pour les projets IT, basé sur la qualité et le bon-sens, sur de multiples axes : expertise technique dans le digital, développement Web, Project Management, AMOA et DevOps.\nDes exemples de projets accompagnés par BluTech:\nGestion de projet en Agile (Coach Agile / Scrum Master, bonnes pratiques du management, pilotage de projet agile et gestion des ressources)\nAMOA du recueil des besoins à la traduction fonctionnelle (projets de transformation digitale)\nDéveloppement d’applications Web Symfony, Angular\nConception technique et architecture SI\nDéploiement d’une solution DevOps basée sur GitLab, Docker, Ansible et Sonar\nFort de ses 15 ans d’expérience dans le milieu, Matthieu a développé un large réseauqui nous permet de sélectionner les plus belles missions clients avec des challenges toujours plus riches pour l'ensemble des collaborateurs.\nBluTech en bref\nBluTech est une jeune ESN à taille humaine où développement rime avec entrepreneuriat ! Chez BluTech, ce sont d'un côté des missions client high level chez les plus belles références, et de l'autre des projets intrapreneuriaux autour desquels s'impliquent tous les collaborateurs.\nBluTech, c’est un peu une mise en abyme de la startup : une startup dans une startup\nEn résumé, top mission, top projets et top team !\nMission\nBluTech recrute un Dev FullStack pour rejoindre son équipe.\nLes missions seront divisées en 2 dimensions :\nExpertise technique\npour les clients (partie ESN) :\nTu participeras aux missions techniques chez les clients afin de développer tes compétences, et faire avancer les clients dans leurs propres projets : au départ\nTu commenceras par intervenir sur les projets au forfait de l’équipe, répartis entre les besoins de build et le run. Cette étape sera majoritairement en remote, sur des projets web autour des framework Vue 3 et NodeJS\nTu pourras ensuite décider de tes missions et de tes clients\nEn général, les missions durent un an en moyenne\nTu bénéficieras d’une journée de télétravail minimum par semaine sur les missions\nCollaboration sur le\nlancement de projets intrapreneuriaux\nà horizon 6 mois\nTu participeras aux sessions de brainstorming pour définir des projets à lancer\nTu seras l’un des contributeurs principaux dans le lancement de ces projets\nLe profil de rêve pour rejoindre l'équipe\nTu es ingénieur avec idéalement une formation informatique\nTu comptes déjà au minimum 3 ans d’expérience, idéalement dans un environnement de société de services\nTu es intervenu sur des projets long terme et as travaillé dans des équipes techniques\nTu es expérimenté avec JavaScript / TypeScript et maîtrises à minima les frameworks : Vue, Node.js\nTu es familier avec PHP (Symfony ou Laravel) ou Java\nTu connais la base de données PostgreSQL\nTu as des compétences DevOps (GitLab, Docker, Ansible…) et Cloud (AWS)\nTu as des expériences de travail en mode Agile\nSi tu rêves de t’investir dans une startup early stage qui a de fortes ambitions pour développer des projets, et de rejoindre une équipe où la co-construction et l’impact sont les valeurs principales, alors cette startup est faite pour toi.\nPourquoi nous rejoindre\nLa bonne ambiance et l’esprit de co-construction dans une startup jeune avec une communication transparente et directe\nLa prise de responsabilités rapide\nLa courbe de progression importante avec la possibilité permanente de développer tes capacités et un plan de formation (minimum 2 formations / an prévues pour chaque collaborateur)\nLa liberté de conception : la possibilité d’apporter tes propres idées et les mettre en œuvre\nDes clients et projets intéressants pour des passionnés de nouvelles technologies\nLa flexibilité, le télétravail, et le work-life-balance\nLe poste de Cadre, Mutuelle, Tickets Restaurants, CE, basé en région parisienne\nUn matériel de qualité (Dell XPS 13 et souris de ton choix )\nLe salaire motivant : 40 à 60K€ / an + intéressement selon profil et expérience"
  },
  {
    "title": "Lead Dev Java Web - Paris 10e (75) - Indeed.com",
    "job_title": "Lead Dev Java Web",
    "jk": "e736a31cb46bb08e",
    "company": "Tripndrive",
    "location": "Paris 10e (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=e736a31cb46bb08e",
    "contract": null,
    "description": "Tripndrive\nNous sommes convaincus que le meilleur moyen de se déplacer est d'avoir une voiture juste quand on en a besoin. Uber, Autolib, et les transports en commun servent les déplacements courts et la proximité. Nous servons le reste. Tripndrive est un service fiable permettant de réserver simplement une voiture de qualité, stationnée à quelques minutes de là, facilement accessible, pour une fraction du prix. Nous simplifions la mobilité des particuliers et des entreprises et réduisons son coût en optimisant l'usage des véhicules grâce notre logiciel home made et des applications performantes.\nStartup d'une quinzaine de personnes dont 4 dev, nous aimons les technos innovantes, l’agilité et la bonne humeur.\nMieux nous connaître ...\nTon profil\nUn véritable\ncollaborateur\n, une personne\npassionnée\npar ce qu’elle fait et\nproactive\n:\nTu es amoureux(se) de la technique et recherche un challenge\nTu connais bien\nJava8 / SpringBoot\net as une bonne connaissance en architecture logicielle (DDD, TDD)\nTu possèdes au moins 1 an d’expérience et tu es issu(e) d’une formation supérieure\nTu connais bien la stack\nWeb\n(HTML/CSS/Javascript) et\nAngularJS\nTu es curieux(se) et aimes apprendre, farouche combatant du \"legacy\" et adepte\nTu veux concevoir un système ambitieux et prendre des responsabilités au sein d’une équipe d'entrepreneurs.\nLes plus :\nUne sensibilité\nDevOps\nTu aimes partager une bière (ou coca) pour fêter une nouvelle release\nTa mission\nRejoindre l'équipe de développement afin de concevoir et développer le système de Tripndrive. Ce dernier représente un réel challenge au croisement de l'IoT, du BigData et des systèmes d'informations riches et complexes.\nChez Tripndrive, pas de communication TopDown, tu seras le porteur du projet techniquement avec les autres développeurs, tu auras à interagir avec les StackHolder, concevoir et faire des choix d'architecture de façon pragmatique et proactive.\nTrès bien, mais tu me diras \"dans la pratique je fais quoi ?\" ... et bien voici un exemple d'une journée :\nTu arrives le matin, prends un café :) A 10h daily SCRUM avec la team tech. Ce matin là tu décides de prendre une tâche sympa (\"Ouverture de la voiture via API\"), coup d'oeil sur la spec, tu commences à réfléchir ... Il te manque des éléments ... Quelques minutes plus tard tu as Slacké le Stackholder pour compléter tes inputs.\n10h42, tu as tous les éléments et t'attaques à la conception, tu t'aperçois que la feature mérite de reprendre un existant modulo un refactoring, tu fais 2/3 schémas sur le whiteboard pour expliquer ta vue des choses. Ton choix est pragmatique et répond aux attentes, c'est validé (Tant mieux tu es un farouche combattant du legacy).\n11h13, tu commences par rédiger les test unitaires (tu es fan de TDD :p )\n12h27, nous mangeons tous ensembles (l'ambiance est très cool, au delà des dej, nous faisons régulièrement des pots et sorties)\n14h08, on rentre dans le dur, se pose alors des questions d'architectures ... Cela tombe bien, le meetup que tu avais prévu ce soir traite de ce sujet, tu profiteras de cet évènement ainsi que de la veille quotidienne, pour proposer des évolutions sur l'architecture du système.\n15h22, tu te rends compte qu'une problématique est commune avec la tâche d'un autre dev, tu échangeras avec lui afin d'éviter de \"redesigner\" la roue (et en plus c'est un passionné comme toi).\n18h37, tu fais une PullRequest en ayant pris soin de relire ton code\nAinsi seras ta mission si tu l'acceptes :)\n#java-certified #spring-expert #angularjs #html5 #bootstrap #aws #redis #elasticsearch #innovative #agile #keep-learning #kiss #geek\nConditions\nDisponibilité : Dès que possible.\nLieu : Paris 10 ème.\nContrat : CDI.\nSalaire : A partir de 40K selon profil\nContact\nMerci d’envoyer ton CV et motivations à nicolas@tripndrive.com ou de remplir le formulaire en ligne."
  },
  {
    "title": "Dév confirmé fullstack Java / ReactJS - Paris (75) - Indeed.com",
    "job_title": "Dév confirmé fullstack Java / ReactJS",
    "jk": "7239abbfee4bb155",
    "company": "One Logic Consulting Group",
    "location": "Paris (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=7239abbfee4bb155",
    "contract": null,
    "description": "Présentation de One Logic Consulting :\nOne Logic\nest un cabinet de conseil IT à taille humaine, fondé par deux développeurs en 2014, spécialisé dans le développement logiciel en finance de marché.\nFort d’une centaine de collaborateurs, One Logic cherche à organiser sa croissance autour de valeurs telles que :\nLa bienveillance,\nen mettant en œuvre un environnement propice à l’épanouissement professionnel de ses collaborateurs.\nLa passion des technologies\n, en s’appuyant sur les meilleures pratiques en cours et à travers les technologies les plus récentes.\nLa Curiosité,\nencouragée à travers des formations et des participations aux\névènements tech majeurs (Ncrafts, Devoxx etc.)\nde manière à échanger et à acquérir de nouvelles pratiques, et être dans un cycle d’\namélioration continue\n.\nOne Logic est engagée dans une démarche de\nResponsabilité Sociale et Sociétale\n, notamment en soutenant le Pacte Mondial des Nations Unies.\nNous sommes fiers d’avoir obtenu la\nmédaille d’or RSE EcoVadis\navec une note de 79/100, ce qui nous place\ndans les 6% d’entreprise les mieux notées de notre secteur\n, et nous permet de conserver ce titre depuis 2020.\nContexte du projet :\nLa mission est une mission de longue durée, chez l'un de nos clients spécialisé dans les avantages salariaux.\nLe projet, en tant que microservice, remplace un sous-ensemble des fonctionnalités de la solution monolithe de backoffice existante et vise à être réutilisé dans d'autres pays. La mise en œuvre d'un composant réutilisable suit la stratégie de globalisation des solutions existantes.\nStack technique : Java, Springboot, React, Javascript, Docker, Kubernetes, Azure Cloud, Azure DevOps\nMissions :\nDévelopper de nouveaux modules tels que spécifiés par le Product Owner en respectant les priorités définies par les cérémonies Agile.\nSoutenir l'équipe dans la prise de décision technique.\nProposer activement des idées pour améliorer la livraison ou la qualité.\nMaintenir et améliorer la solution\nDévelopper en respectant le processus de gestion de projet Scrum Agile\nMaintenir et développer des pipelines CI/CD/CT\nProfil :\nLa mission s'effectue au sein d'une équipe existante et exige de tout nouveau collaborateur :\nÉcoute, curiosité, grande rigueur dans le travail et autonomie.\nExcellentes qualités relationnelles et volonté d'interagir avec les clients internes et externes\nDe fortes capacités d'analyse et de synthèse\nTravail collaboratif entre équipes\nCapacité à proposer et à mettre en œuvre des solutions\nAssurer la mise en œuvre des standards et de la qualité de la Global Digital Factory\nAssurer la cohérence technique de la solution\nS'assurer que les bonnes pratiques et l'état de l'art sont pris en compte au sein de sa squad\nParticiper aux rituels de la Global Digital Factory (IP, démos, Retrospectives, Daily, Design Authority)\nLe projet prenant place dans un contexte international,\nla maîtrise de l'anglais est nécessaire.\nOne Logic s’engage à évaluer chaque nouvelle candidature sans discrimination liée au handicap, à l’âge, au genre, à l’origine, à la religion, à l’orientation sexuelle ou toute autre caractéristique protégée par la loi. Si vous êtes en situation de handicap, n'hésitez pas à nous faire part de vos éventuels besoins spécifiques afin que nous puissions les prendre en compte."
  },
  {
    "title": "Lead Dev - Algorithmes Systèmes d'Armes F/H - 92350 Le Plessis-Robinson - Indeed.com",
    "job_title": "Lead Dev",
    "jk": "94dc874efc329dcd",
    "company": "MBDA France",
    "location": "Algorithmes Systèmes d'Armes F/H",
    "canonical": "https://fr.indeed.com/viewjob?jk=94dc874efc329dcd",
    "contract": null,
    "description": "Rejoignez la\nDirection Software Engineering\nqui développe l'ensemble des moyens logiciels nécessaire au bon fonctionnement de nos systèmes d'armes.\nIntégrez le\nService Logiciel Algorithmes pour les Systèmes d'Arme\n, en charge du développement des algorithmes intégrés dans les logiciels des systèmes d'arme, permettant de calculer les données nécessaires à un missile pour accomplir sa ou ses mission(s).\nVous rejoindrez une équipe composée d'une quinzaine de personnes.\nÊtre\nLead Dev Logiciel\nchez MBDA, c'est :\nParticiper aux activités de développement, depuis la conception jusqu’à la validation\nParticiper à l’implémentation des solutions retenues et apporter du support aux phases d’intégration des Algorithmes\nContribuer au maintien en conditions opérationnelles des Algorithmes\nConstruire les roadmap technologiques et projets en ligne avec les architectes logiciels\nCo-animer les réunions techniques pour échanger sur les sujets d’innovation, l’avancement des développements…\nApporter son support aux chefs de projets logiciels lors des phases de chiffrage\nAssurer la veille technologique sur le métier et proposer des sujets d’innovation\nDévelopper le métier, faire évoluer les process, trouver les synergies et favoriser la création de lignes produits\nIssu(e) d'une formation de niveau Bac+5, vous justifiez d'une\nexpérience de 5 ans minimum\nen développement logiciel.\nVous avez des solides connaissances en langage orienté objet et en programmation fonctionnelle. Vous êtes à l’aise avec les standards récents C++ et/ou Java. Vous savez appliquer les design patterns appropriés en fonction du langage et des cas rencontrés.\nVous êtes sensibilisé aux concepts d'intégration continue, DevOps et IA.\nSi vous rejoignez l'équipe, vous évoluerez dans l'environnement technique suivant :\nDéveloppement orienté objet : UML, Design Patterns, Java, C++, JNI\nFormats standards : XML, Xerces, Dom, XSLT\nCompte tenu de l'environnement international de notre société, un bon niveau d'anglais est nécessaire.\nLes défis technologiques de l’industrie de défense vous motivent ? Envoyez-nous votre candidature !\nEn plus des nombreux échanges au sein de l'équipe, vous serez amené(e) à collaborer étroitement avec l'équipe fonctionnelle en interface avec le client final.\nLa diversité des activités au sein du département offre de nombreuses perspectives d’évolution tant dans le domaine technique que dans le domaine de la gestion de projet."
  },
  {
    "title": "Software Engineer Trainee - 75015 Paris 15e - Indeed.com",
    "job_title": "Software Engineer Trainee",
    "jk": "b5917f63a444f68a",
    "company": "Structure",
    "location": "75015 Paris 15e",
    "canonical": "https://fr.indeed.com/viewjob?jk=b5917f63a444f68a",
    "contract": "CDI",
    "description": "<p>Structure.fi is a venture-backed startup building the default platform for <b>AI-designed algorithmic trading strategies in crypto</b>.</p>\n<p>We’re looking for <b>elite software engineers</b> who want to work <b>onsite, full-time, Sunday–Thursday</b>, in a <b>high-intensity, high-upside</b> environment.</p>\n<p>This is <b>not</b> a cushy remote job, and it’s <b>not</b> a French-corporate-style CDI.<br>You’ll join a <b>tiny, senior team (~7 people)</b> with founders from <b>MIT and Jump Trading</b>, backed by <b>Polychain Capital</b>, to build real trading infrastructure: execution, risk, monitoring – not toy retail dashboards.</p>\n<p>If you’re optimizing for <b>growth, impact, and upside</b> (not “balance”), and you like the idea of helping build a <b>billion‑dollar company in ~18 months</b>, keep reading.</p>\n<ul>\n <li>Design, build, and operate <b>backend and infrastructure</b> for AI-driven algorithmic trading in crypto.</li>\n <li>Work closely with founders on:</li>\n <li><b>Low-latency execution systems</b></li>\n <li><b>Data pipelines</b> and model integration</li>\n <li><b>Risk and monitoring</b> infrastructure in production</li>\n <li>Ship <b>real features to production fast</b>, iterate based on live performance, and own your systems end-to-end.</li>\n <li>Help define and enforce <b>engineering standards</b> (code quality, testing, performance, observability).</li>\n <li>Collaborate directly with a <b>small, high-caliber team</b> in the office every day.</li>\n <li>Contribute to <b>technical decision-making</b> on architecture, tools, and tradeoffs.</li>\n <li>Embrace <b>startup intensity</b>: nights and weekends when objectives require it. Not for vanity, but to win.</li>\n</ul>\n<p>We care more about capability and trajectory than fancy titles. As a benchmark, you likely have:</p>\n<ul>\n <li><b>Strong programming skills</b> in at least one systems/backend language (e.g. Rust, C++, Go, Java, or similar).</li>\n <li>Experience building <b>production systems</b> where correctness, performance, and reliability matter.</li>\n <li>Solid understanding of:</li>\n <li>Data structures &amp; algorithms</li>\n <li>Concurrency and distributed systems basics</li>\n <li>Systems performance (profiling, optimization)</li>\n <li>Comfort working close to:</li>\n <li><b>Infra / dev tooling / distributed systems</b>, and/or</li>\n <li><b>Low-latency / trading / real-time systems</b></li>\n</ul>\n<p>Bonus points (not required, but strong signals):</p>\n<ul>\n <li>Experience in <b>trading, quant, HFT, or financial infrastructure</b>.</li>\n <li>Experience with <b>crypto</b> (exchanges, wallets, DeFi primitives).</li>\n <li>Experience with <b>AI/ML systems</b> in production.</li>\n</ul>\n<p>Mindset (non‑negotiable):</p>\n<ul>\n <li>You <b>want</b> intensity and accountability. You’d rather be stretched than bored.</li>\n <li>You are <b>competitive</b>: you like to win, you like to get better, you like hard problems.</li>\n <li>You communicate clearly: you can explain complex technical ideas in simple language.</li>\n <li>You think like an <b>owner</b>, not an employee. You care about the outcome, not just your ticket queue.</li>\n</ul>\n<p>Logistics:</p>\n<ul>\n <li><b>Onsite in Paris</b>, in the office <b>every workday</b>.</li>\n <li>You can legally work as an <b>independent contractor in France</b> (micro‑entrepreneur / auto‑entrepreneur or equivalent), or are willing to set that up.</li>\n <li>A <b>B2B freelance engagement</b> with a high-caliber, venture-backed team (Polychain, MIT, Jump).</li>\n <li>A <b>very competitive daily rate</b>, invoiced monthly by the contractor under their own independent legal status.</li>\n <li>A <b>3-month initial evaluation phase</b> to determine whether both sides want to continue the collaboration long-term.</li>\n <li>After a successful evaluation period, Structure.fi may choose—at its discretion—to offer:</li>\n <li><b>Access to onsite meals</b> for convenience.</li>\n <li><b>Optional performance-based incentives</b> defined contractually.</li>\n <li><b>Potential equity participation</b> through a separate agreement.</li>\n <li><b>Case-by-case administrative or relocation support</b> for contractors who want to be closer to the office.</li>\n <li>No traditional employment benefits are provided, as this is <b>not an employment relationship</b>.</li>\n</ul>\n<p><b>Structure.fi</b> est une startup financée par des fonds de capital-risque qui construit la plateforme de référence pour la conception de stratégies de trading algorithmique en crypto, pilotées par l’IA.</p>\n<p>Nous recherchons des <b>ingénieurs logiciels d’élite</b> souhaitant travailler <b>sur site, à temps plein, du dimanche au jeudi</b>, dans un environnement <b>intense, exigeant et à fort potentiel</b>.</p>\n<p>Ce n’est <b>pas</b> un poste remote confortable, ni un <b>CDI à la française</b>.<br>Vous rejoindrez une <b>équipe très réduite et senior (~7 personnes)</b>, avec des fondateurs issus du <b>MIT et de Jump Trading</b>, soutenue par <b>Polychain Capital</b>, pour construire de <b>véritables infrastructures de trading</b> : exécution, gestion du risque, monitoring — pas des dashboards grand public simplistes.</p>\n<p>Si vous privilégiez la <b>croissance, l’impact et l’upside</b> (et non “l’équilibre”), et que l’idée de contribuer à la construction d’une <b>entreprise d’un milliard de dollars en ~18 mois</b> vous motive, continuez à lire.</p>\n<p>Votre mission</p>\n<p>Concevoir, développer et opérer des systèmes backend et d’infrastructure pour le trading algorithmique crypto piloté par l’IA.</p>\n<p>Travailler en étroite collaboration avec les fondateurs sur :</p>\n<ul>\n <li>Des systèmes d’exécution à faible latence</li>\n <li>Des pipelines de données et l’intégration des modèles</li>\n <li>Des infrastructures de gestion du risque et de monitoring en production</li>\n</ul>\n<p>Déployer rapidement de vraies fonctionnalités en production, itérer à partir des performances réelles et être responsable de vos systèmes de bout en bout.</p>\n<p>Contribuer à la définition et à l’application des standards d’ingénierie (qualité du code, tests, performance, observabilité).</p>\n<p>Collaborer quotidiennement au bureau avec une équipe réduite et très performante.</p>\n<p>Participer aux décisions techniques : architecture, outils, compromis techniques.</p>\n<p>Assumer l’intensité propre à une startup : soirées et week-ends lorsque les objectifs l’exigent. Pas par ego, mais pour gagner.</p>\n<p>Profil recherché</p>\n<p>Nous valorisons davantage les <b>compétences et la trajectoire</b> que les titres prestigieux. À titre indicatif, vous avez probablement :</p>\n<ul>\n <li>De solides compétences en programmation dans au moins un langage système / backend</li>\n</ul>\n<p>(ex. : Rust, C++, Go, Java ou équivalent)</p>\n<ul>\n <li>Une expérience dans la création de systèmes en production où la <b>justesse, la performance et la fiabilité</b> sont critiques</li>\n <li>Une bonne maîtrise de :</li>\n <li>Structures de données &amp; algorithmes</li>\n <li>Concurrence et bases des systèmes distribués</li>\n <li>Performance système (profiling, optimisation)</li>\n</ul>\n<p>À l’aise avec :</p>\n<ul>\n <li>L’infrastructure, l’outillage dev, les systèmes distribués, et/ou</li>\n <li>Les systèmes temps réel, low-latency ou de trading</li>\n</ul>\n<p><b>Atouts (non obligatoires, mais forts signaux)</b> :</p>\n<ul>\n <li>Expérience en trading, quant, HFT ou infrastructures financières</li>\n <li>Expérience crypto (exchanges, wallets, primitives DeFi)</li>\n <li>Expérience de systèmes IA/ML en production</li>\n</ul>\n<p>Mentalité (non négociable)</p>\n<ul>\n <li>Vous recherchez l’intensité et la responsabilité. Vous préférez être challengé que vous ennuyer.</li>\n <li>Vous êtes compétitif(ve) : vous aimez gagner, progresser et résoudre des problèmes difficiles.</li>\n <li>Vous communiquez clairement et savez expliquer des concepts complexes simplement.</li>\n <li>Vous raisonnez comme un propriétaire, pas comme un employé. Le résultat compte plus que la liste de tickets.</li>\n</ul>\n<p>Logistique</p>\n<ul>\n <li>Poste <b>sur site à Paris</b>, au bureau chaque jour ouvré</li>\n <li>Capacité à travailler légalement en <b>tant qu’indépendant en France</b> (micro-entrepreneur / auto-entrepreneur ou équivalent), ou volonté de mettre ce statut en place</li>\n</ul>\n<p>Conditions</p>\n<ul>\n <li>Mission freelance B2B avec une équipe de très haut niveau, financée par des fonds (Polychain, MIT, Jump)</li>\n <li><b>Taux journalier très compétitif</b>, facturé mensuellement par le prestataire sous son propre statut juridique</li>\n <li><b>Période d’évaluation initiale de 3 mois</b> afin de déterminer si les deux parties souhaitent poursuivre la collaboration à long terme</li>\n</ul>\n<p>À l’issue de cette période, <b>Structure.fi pourra, à sa discrétion</b>, proposer :</p>\n<ul>\n <li>L’accès à des repas sur site pour plus de confort</li>\n <li>Des incentives basés sur la performance, définis contractuellement</li>\n <li>Une participation potentielle au capital via un accord séparé</li>\n <li>Un accompagnement administratif ou à la relocalisation, au cas par cas, pour les prestataires souhaitant se rapprocher du bureau</li>\n</ul>\n<p>Aucun avantage salarié traditionnel n’est fourni, car il ne s’agit pas d’une relation de travail salariée.</p>\n<p>Job Type: Full-time</p>\n<p>Pay: 65,000.00€ - 100,000.00€ per year</p>\n<p>Work Location: In person</p>"
  },
  {
    "title": "QA Engineer - Software Editor - France - Indeed.com",
    "job_title": "QA Engineer",
    "jk": "44c9c1644f88b093",
    "company": "Jahia Solutions France",
    "location": "Software Editor",
    "canonical": "https://fr.indeed.com/viewjob?jk=44c9c1644f88b093",
    "contract": "CDI",
    "description": "<p>Our team is looking for a passionate QA Engineer to join our team in France!</p>\n<p>Jahia started its life as a CMS platform, quite some time ago, and has evolved since then into a digital experience platform (DXP) serving customers (such as Ben &amp;Jerry’s, the European Parliament, Netsmart, Pole Emploi) who either provide a public platform serving millions of unique visitors per year or built an extensive intranet used by thousands of employees daily.</p>\n<p>We are a software company, we build software solutions available to our customers either on Jahia Cloud or on-premise.</p>\n<p>In the day-to-day of our product development team, we develop features used primarily by three different personas:</p>\n<p>● content editors and marketers use our back-office UIs to manage their platforms (edit / publish content, create personalization rules, …).</p>\n<p>● system administrators and DevOps who install, operate, and maintain environments built around products we develop.</p>\n<p>● developers, who use our APIs to build websites and integrations.</p>\n<p>As a QA Engineer, this means you will be helping your team by testing a very diverse range of topics, not only testing UIs but also APIs (HTTP, Java APIs, JS APIS), backend features, and often deploying your environments on Jahia Cloud, locally using Docker or on AWS. You will ensure work delivered by your team meets our quality standards and can make its way to a release.</p>\n<p><b>Our QA Approach </b></p>\n<p>At Jahia, software quality is a team effort. We strive to test new development as early as possible in the dev cycle and to automate as much as possible. As a QA Engineer,</p>\n<p>● you will mostly have to deal with technical functional tests,</p>\n<p>● you will also be helping your team identify which test cases to cover with automated tests,</p>\n<p>● you will sometimes contribute to their implementation</p>\n<p>● and you will have access to CI/CD tooling to validate the test scenario you and your team identified.</p>\n<p><b>Our QA stack: </b></p>\n<p>● Modern Automation: Cypress tests running in Docker, triggered by pull requests, merges, schedules, or manual actions, executed on GitHub Actions.</p>\n<p>● Legacy Automation: Selenium (Java) tests on Atlassian Bamboo. We are migrating these to Cypress.</p>\n<p>● Unit and integration tests (mostly Java based tests, some Cypress tests) - which are mainly handled by the developers of the teams, but sometimes watched by QA</p>\n<p>● All these automated tests and additional manual/functional tests are used to continuously validate new development and to validate module releases and Jahia releases.</p>\n<p>● Other Tools we use: Testrail, Typescript, yarn, maven, AWS, GitHub Issues, Elasticsearch, Docker.</p>\n<p><b>Extended product stack </b></p>\n<p>We are a Java &amp; JS/TS shop, integrating some of the Apache Foundation’s projects. Our core product (Jahia) is relying on OSGi to extend our feature-set through a wide set of applications and components (See https://store.jahia.com/). Our backend exposes a GraphQL API, that can be used by our clients in the context of a Headless CMS, or to extend their existing sites through some of our components (such as Elasticsearch-backed text search).</p>\n<p>Our front-end is built as a micro-front end architecture. Webpack 5 module federation, allows us to use a mix of front-end technologies although React is currently our UI library of choice. Our teams are fluent in Javascript (ES 6+) and Typescript, we built our own design system (moonstone) and integrate it in complex UIs built with CSS in JS, Apollo, and more.</p>\n<p><b>What You Will Be Doing </b></p>\n<p>You will be working in a fast-paced Agile-based development environment and be responsible for:</p>\n<ul>\n <li>Validate individual stories delivered by your team</li>\n</ul>\n<ul>\n <li>Ahead of implementation, work alongside your team to identify test cases for individual stories</li>\n</ul>\n<ul>\n <li>Maintain manual test cases related to features developed by your team (we currently use test rail)</li>\n</ul>\n<ul>\n <li>Validate and sign off on module releases and Jahia releases</li>\n</ul>\n<ul>\n <li>Report defects and qualify defects reported by our support team, so that the impacts of the issues are identified and a clear reproduction scenario is made available to developers</li>\n</ul>\n<ul>\n <li>Contribute to the implementation of automated tests</li>\n</ul>\n<p><b>Profile We Are Looking for </b></p>\n<p><b>Technical skills </b></p>\n<ul>\n <li>You are experienced in the latest industry practices in terms of QA and test automation and have solid previous technical experience with testing frameworks (we use Cypress and Selenium) and programming languages used with these frameworks.</li>\n</ul>\n<ul>\n <li>You <b>love to code </b>and <b>have solid previous experience in Java and Javascript </b>(or solid knowledge on other programming languages and a willingness to learn). You might not code every day, but will need to dig deep to help your team when challenges arise.</li>\n</ul>\n<ul>\n <li>Docker is no mystery to you, you used this before or you are already familiar with it</li>\n</ul>\n<ul>\n <li>Topics like cross-browser testing, API testing, security testing or performance testing are not unknown for you</li>\n</ul>\n<p><b>Soft skills </b></p>\n<ul>\n <li>You are an enthusiastic learner with a thirst for knowledge.</li>\n</ul>\n<ul>\n <li>Good <b>team player</b>. You’ll be part of the Jahia family and this is important to us.</li>\n</ul>\n<ul>\n <li>Self-starter, <b>quick learner, </b>and <b>self-motivated</b>.</li>\n</ul>\n<ul>\n <li>Comfortable voicing QA concerns, writing reports, and collaborating with cross-functional teams.</li>\n</ul>\n<ul>\n <li>Detail-oriented, creative in finding edge cases and risks, and proactive in raising concerns.</li>\n</ul>\n<p><b>What’s in it for you ? </b></p>\n<ul>\n <li>Flexibility: Full Remote work possible, Flex work with 2 office days/week if Lyon or Paris</li>\n</ul>\n<ul>\n <li>Support: Friendly, trusting, and honest team culture.</li>\n</ul>\n<ul>\n <li>Influence: Freedom to bring new ideas and improve our processes</li>\n</ul>\n<ul>\n <li>Growth: Paid training or conferences (usually one per year) to support your professional development.</li>\n</ul>\n<ul>\n <li>Tools: We provide up-to date technologies to ensure you have everything you need to do your best work</li>\n</ul>\n<ul>\n <li>Opportunity: Be part of a team shaping the future of Jahia’s DXP</li>\n</ul>\n<ul>\n <li>11 additional days of vacation per year</li>\n</ul>\n<ul>\n <li>2 days of volunteering per year</li>\n</ul>\n<ul>\n <li>€10 meal vouchers per day, 60% covered by the employer</li>\n</ul>\n<ul>\n <li>Health insurance covered at 80%</li>\n</ul>\n<p>Type d'emploi : Temps plein, CDI<br>Statut : Cadre</p>\n<p>Rémunération&nbsp;: à partir de 50 000,00€ par an</p>\n<p>Question(s) de présélection:</p>\n<ul>\n <li>Quel est votre niveau d'anglais ?</li>\n <li>Avez-vous un préavis, si oui de combien de temps ?</li>\n <li>Quelles sont vos prétentions salariales en k€ ?</li>\n</ul>\n<p>Lieu du poste : Télétravail</p>"
  },
  {
    "title": "Développeur.se Fullstack Senior - Paris (75) - Indeed.com",
    "job_title": "Développeur.se Fullstack Senior",
    "jk": "7218ea484445dc2d",
    "company": "Breople",
    "location": "Paris (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=7218ea484445dc2d",
    "contract": null,
    "description": "<div>\n <p><b>Qui sommes-nous ?</b><br> Chez Breople [bripol], nous accompagnons nos clients dans leur transformation numérique. Nous mettons à leur disposition des consultant.e.s spécialisé.e.s dans la création d’expériences digitales sur mesure, allant du mini site à la plateforme de marque, en passant l’application métier.<br> <br> <b>Votre Poste</b></p>\n <p>Au sein de notre équipe Dev &amp; Design, tu auras pour mission de prendre en charge le développement front-end et back-end des produits et applications de nos clients qu’ils en soient au stade de MVP ou plus avancés.</p>\n <p><b><br> Ton rôle au Quotidien</b></p>\n <ul>\n  <li><p>Être référent.e sur les différentes projets techniques attribués, sur les technologies choisies et les bonnes pratiques</p></li>\n  <li><p>Concevoir et développer des fonctionnalités en construisant un code de qualité : maintenable &amp; scalable</p></li>\n  <li><p>Aider ton client à prioriser les fonctionnalités produit pour apporter un maximum de valeur à son business</p></li>\n  <li><p>Participer aux analyses et aux politiques de tests (TDD, BDD)</p></li>\n  <li><p>Avoir une approche orientée utilisateur final et être force de proposition quant aux outils / technos à mettre en place</p></li>\n </ul>\n <p></p>\n <p><b><br> Stack Technique</b></p>\n <p>Nous intervenons principalement sur les environnements suivants : JavaScript, ReactJS, NodeJS, NestJS, VueJS, Angular, TypeScript, Java …</p>\n <p><b><br> Quelques exemples de projets menés récemment :</b></p>\n <ul>\n  <li><p>Développement d’un catalogue d’application pour un acteur du BTP</p></li>\n  <li><p>Création d’une application mobile pour un acteur majeur de l’Immobilier</p></li>\n  <li><p>Réalisation d’une application métier pour un Leader de la Cosmétique</p></li>\n </ul>\n <p></p>\n <p><br> Ce poste est fait pour toi si :</p>\n <ul>\n  <li><p>Tu justifies au minimum de 5 ans d’expérience dans le développement fullstack, front ou back</p></li>\n  <li><p>Tu es passionné.e de technologie et justifies d’une bonne maîtrise sur la majorité de nos environnements de développement</p></li>\n  <li><p>Tu souhaites intervenir sur des projets à forte valeur ajoutée</p></li>\n  <li><p>Tu es motivé.e pour intégrer une structure alliant l’exigence d’un société de conseil et le dynamisme et l’agilité d’une start-up.</p></li>\n  <li><p>Tu recherches un cabinet capable de t’accompagner ton évolution et ton épanouissement en tant que Développeur(se).</p></li>\n  <li><p>Tu possèdes un excellent relationnel, le goût du travail en équipe et un sens prononcé de la qualité.</p></li>\n </ul>\n <p></p>\n <p><br> En plus de leurs projets, nos consultant(e)s apprécient chez nous les avantages suivants :</p>\n <ul>\n  <li><p>Accès à un parcours de formation et de certification illimité, adapté et valorisant.</p></li>\n  <li><p>Télétravail à 100%, tant que ton client final ne s’y oppose pas.</p></li>\n  <li><p>Prime Télétravail de 50€ / mois pour aider à vous équiper chez vous</p></li>\n  <li><p>Prime d’intéressement</p></li>\n  <li><p>Prime vacances</p></li>\n </ul>\n</div>\n<p></p>"
  },
  {
    "title": "Développeur Java Spring Boot Sénior H/F - Paris (75) - Indeed.com",
    "job_title": "Développeur Java Spring Boot Sénior H/F",
    "jk": "4249f5ed4fdb33d8",
    "company": "NEXTON",
    "location": "Paris (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=4249f5ed4fdb33d8",
    "contract": "CDI",
    "description": "Description de l'entreprise\nQui sommes-nous ?\nRejoindre NEXTON, c'est intégrer une entreprise où convergent l'esprit d'un cabinet de conseil, la créativité d'une agence et la dynamique d'une ESN ! Grâce à notre expertise, nous accompagnons des clients grands comptes et des pure players tels que SNCF, Orange, et BNP Paribas dans leurs stratégies d'évolution et d'innovation digitale.\nFondée en 2011, NEXTON réunit aujourd'hui une équipe de plus de 450 experts spécialisés dans le digital, le design, l'agilité, le produit et le développement. Ensemble, ils créent un écosystème riche en connaissances et en compétences diversifiées.\nDescription du poste\nNEXTON\nrecrute un\nDéveloppeur Java Spring Boot H/F\n, en\nCDI\n, à\nParis !\nTon futur environnement de travail :\nEn tant que\nDéveloppeur Java Spring Boot\n, tu joues un rôle clé dans le pilotage et la stratégie de l'offre commerciale de notre client.\nTes missions :\nTu vas contribuer au pilotage et à l’orientation stratégique de leur offre commerciale\n, notamment en exploitant des WebServices, en mettant en place des mappings avancés.\nTu vas prendre un rôle de leadership technique dans le développement et l’amélioration de leurs outils B2B\net internes en mode Self Service (remontée des ventes, plateformes de partage documentaires, configurations dynamiques…).\nTu vas évaluer et influencer leurs futures solutions technologiques\n(participation aux Comités d’Architecture, encadrement de mob programming, animation d’ateliers de conception).\nTu vas superviser le monitoring et l’optimisation du code en production\n, ainsi que les déploiements.\nTu vas définir et améliorer continuellement leurs politiques de tests\n, checklists d’intégration, et conventions de code.\nQualifications\nDe formation supérieure, tu disposes d'une expérience significative en tant que développeur Java Spring Boot (H/F).\nTu maîtrises Java 21 et Maven (streams, Records, virtual Threads, classes scellées, gestion des dépendances et plugins). Tu sais former des collègues et tu n’as pas peur du Java oldschool. IntelliJ, c’est ton outil.\nTu as une expérience solide en Webservices (SOAP, RESTful), gestion des formats d’entrée/sortie, et tu es autonome avec WSDL, Swagger, etc.\nExpert Spring (Core/Boot/Data) avec de l’expérience en déploiement et conception d’applications.\nTu as des compétences avancées en Cloud (GCP, Azure, AWS) : diagnostic, logs, dépannage.\nTu es autonome sur Linux/MacOS et dans la gestion des environnements de dev (Docker, SSH, versions logicielles).\nUn plus si :\nGCP/Terraform\n: une expérience de DevOps dans cet environnement.\nGitLab\n: autonomie sur la création/modification de pipelines.\nDocker\n: capacité à gérer et optimiser les images en fonction des besoins de production.\nReact\n: maîtrise approfondie de React pour prendre en charge des projets complexes au cœur de nos applications.\nTypescript\n: expertise en typage fort pour garantir la robustesse et la maintenabilité du code.\nInformations supplémentaires\nPourquoi choisir NEXTON ?\nNous te proposons des avantages et des opportunités pour enrichir ton expérience professionnelle et personnelle tout au long de l'année :\nDes communautés dynamiques pour t'accompagner dans ton parcours.\nDes Meet Up pour développer tes compétences.\nDes formations pour te réinventer et progresser.\nDes événements sportifs et festifs pour t'épanouir.\nUn forfait mobilité durable pour faciliter ton quotidien et encourager la mobilité douce.\nUn téléphone de dernière génération pour rester connecté.\nPrêt à nous rejoindre ?\nRencontrons-nous !\nNEXTON"
  },
  {
    "title": "Développeur Backend H/F - 92230 Gennevilliers - Indeed.com",
    "job_title": "Développeur Backend H/F",
    "jk": "d977547de6d3ab86",
    "company": "Geodis",
    "location": "92230 Gennevilliers",
    "canonical": "https://fr.indeed.com/viewjob?jk=d977547de6d3ab86",
    "contract": "CDI",
    "description": "<div></div>\n<div>\n <div>\n  <div>\n   GEODIS est un leader mondial du transport et de la logistique, reconnu pour son expertise sur l'ensemble de la supply chain. Partenaire de croissance de ses clients, GEODIS intervient sur cinq métiers : l'optimisation de la chaîne d'approvisionnement, le Freight Forwarding, la logistique contractuelle, la distribution &amp; l'express et le transport routier. Avec un réseau mondial couvrant près de 166 pays et plus de 49 720 collaborateurs, GEODIS se classe au sixième rang mondial de son secteur. En 2024, GEODIS a réalisé un chiffre d'affaires de 11,3 milliards d'euros. GEODIS est une société du groupe SNCF. <br> A compétences égales, une attention particulière sera accordée aux candidatures des personnes en situation de handicap.\n  </div>\n  <div>\n   <h3 class=\"jobSectionHeader\"><b>Référence </b></h3>2023-11142\n  </div>\n </div>\n <h3 class=\"jobSectionHeader\"><b>Line Of Business </b></h3>\n <p>DISTRIBUTION &amp; EXPRESS</p>\n <h2 class=\"jobSectionHeader\"><b> Description du poste</b></h2>\n <h3 class=\"jobSectionHeader\"><b> Type de contrat </b></h3>\n <p>CDI-Temps plein</p>\n <h3 class=\"jobSectionHeader\"><b> Fonction </b></h3>\n <p>Fonctions Supports - Informatique</p>\n <h3 class=\"jobSectionHeader\"><b> Intitulé du poste </b></h3>\n <p>Développeur Backend H/F</p>\n <h3 class=\"jobSectionHeader\"><b> Description de la mission </b></h3>\n <div>\n  Intégré(e) au sein de la Dev Factory du siège de Distribution &amp; Express du groupe GEODIS, vous aurez pour mission principale de porter la vision technique du produit.<br> <br> Rattaché(e) au Lead Développeur, vos principales missions seront :<br>\n  <ul>\n   <li>Délivrer régulièrement des incréments fonctionnels pour le développement en Java.</li>\n   <li>Accompagner l'équipe sur la voie de la qualité logicielle : Test-driven development (TDD), revues de code, pair programming, etc.</li>\n   <li>Co-animer, suivre ou animer des formations sur une ou plusieurs thématiques : méthodologie, techniques, etc.</li>\n   <li>Contribuer au rayonnement de la culture Software Craftsmanship en interne (formation des nouveaux, collaboration avec d'autres, retours d'expérience).</li>\n  </ul>\n </div>\n <h3 class=\"jobSectionHeader\"><b> Profil du candidat </b></h3>\n <p>De formation Bac+ 3 ou + 4 vous êtes motivé(e) et enthousiaste. Vous disposez d'au moins 5 ans d'expérience en développement d'applications et vous maîtrisez JAVA J2EE 8 et JSF. Vous aimez travailler en équipe avec des cultures Agile et Craftsmanship. Autonome, organisé(e) et déterminé(e), vous disposez d'un bon esprit d'analyse et vous êtes fan de l'amélioration continue avec un esprit positif.</p>\n <h3 class=\"jobSectionHeader\"><b>Temps de travail en % </b></h3>\n <p>100</p>\n <h2 class=\"jobSectionHeader\"><b> Lieu de prise de service </b></h2>\n <h3 class=\"jobSectionHeader\"><b>Lieu de prise de service </b></h3>\n <p>Europe, France, Île-de-France, Hauts-de-Seine</p>\n <h3 class=\"jobSectionHeader\"><b> Ville(s) </b></h3>\n <p></p>\n <div>\n  7/9 route des Mercières 92230 GENNEVILLIERS\n </div>\n <p></p>\n <h2 class=\"jobSectionHeader\"><b> Critères candidat</b></h2>\n <h3 class=\"jobSectionHeader\"><b> Niveau d'études min. requis </b></h3>\n <p>BAC+4 / MAITRISE / MASTER(1)</p>\n <h3 class=\"jobSectionHeader\"><b> Niveau d'expérience dans la fonction </b></h3>\n <p>Confirmé (5 à 10 ans d'expérience)</p>\n</div>"
  },
  {
    "title": "Développeur TALEND - 75002 Paris - Indeed.com",
    "job_title": "Développeur TALEND",
    "jk": "956283fc6565b795",
    "company": "Synopsia Ingénierie",
    "location": "75002 Paris",
    "canonical": "https://fr.indeed.com/viewjob?jk=956283fc6565b795",
    "contract": null,
    "description": "<div>\n <p>SYNOPSIA est une société de Service et d’Ingénierie Informatique à taille humaine. Créée en 1999, elle accompagne depuis 20 ans ses clients dans la concrétisation de leurs projets numériques, en mettant à leur disposition une expertise technique et des compétences métier.</p>\n <p>Chez SYNOPSIA nous avons à cœur d’avoir une réelle proximité avec chacun de nos salariés et nous œuvrons pour le développement de leur carrière en adéquation avec leur projet professionnel. A ce titre, nous attachons une grande importance au choix des missions et à la formation professionnelle. Nous recherchons des Hommes et des Femmes qui partagent nos valeurs : le sens du service, une ouverture d’esprit et une volonté de relever les défis qui se présentent à eux.</p>\n <p></p>\n <p>Nous recherchons activement un <b>Développeur TALEND </b>pour une prise de poste rapide.</p>\n <p>Vous intégrerez un projet pour lequel vous devrez relever les challenges d’aujourd’hui et de demain en intégrant les données au sein d’infrastructures, On-Premise et Cloud.<br></p>\n <p></p>\n <p><b>Vos missions principales : </b></p>\n <p></p>\n <ul>\n  <li>Participation aux réunions recueille du besoin et les réunions d’estimation de charge</li>\n </ul>\n <ul>\n  <li>Rédaction des spécifications techniques détaillées et la documentation technique sur confluence</li>\n </ul>\n <ul>\n  <li>Développement des flux Talend de synchronisation des données</li>\n </ul>\n <ul>\n  <li>Intégration de plusieursformats de données(positionnel, csv, xml,API, Basesdedonnées,…)</li>\n </ul>\n <ul>\n  <li>Développement des jobs Talend d’import des fichiers</li>\n </ul>\n <ul>\n  <li>Manipulation et gestion des schémas complexe des fichiers XML</li>\n </ul>\n <ul>\n  <li>Optimisation des flux Talend et définition des bonnes pratiques sur les jobs existants et leurs migration sur la nouvelle version Talend</li>\n </ul>\n <ul>\n  <li>Participation aux développements des scripts SQL</li>\n </ul>\n <ul>\n  <li>Développement de routines Java pour l’implémentation de règles métiers spécifiques</li>\n </ul>\n <ul>\n  <li>Gérer le processus de livraison des jobs Talend sur les différents environnements : Dev, Recette, Production</li>\n </ul>\n <ul>\n  <li>Projet Migration de Talend</li>\n </ul>\n <ul>\n  <li>Mise en place d’une procédure de gestion d’import des fichiers et la gestion des contexte</li>\n </ul>\n <ul>\n  <li>Réalisation d’un format pivot pour le traitement des fichiers sources</li>\n </ul>\n <ul>\n  <li>Réalisation des développements des différents Jobs Talend</li>\n </ul>\n <ul>\n  <li>Tests d’intégration</li>\n </ul>\n <ul>\n  <li>Support pour les mises en productions<br></li>\n </ul>\n <p></p>\n <p><b>Compétences requises : </b></p>\n <p>Langage PL/SQL maitrisé, API REST, Expérience sur AWS appréciée, Pratique d'un outils d'intégration ETL/ELT</p>\n <p></p>\n <p><b>5 ans d'expériences </b>sur du développement <b>TALEND </b>est <b>IMPERATIF.<br> </b></p>\n <p></p>\n <p>Le poste vous intéresse, envoyez-nous votre CV dès maintenant, nous reviendrons vers vous au plus vite. <br> Vous pouvez également nous envoyer votre candidature directement sur la boite : offres@synopsia.com avec la référence JS_D24A0002.</p>\n</div>\n<p></p>"
  },
  {
    "title": "Ingenieur Logiciel en finance de marché H/F - 92100 Boulogne-Billancourt - Indeed.com",
    "job_title": "Ingenieur Logiciel en finance de marché H/F",
    "jk": "f2710c59e1750774",
    "company": "Aneo",
    "location": "92100 Boulogne-Billancourt",
    "canonical": "https://fr.indeed.com/viewjob?jk=f2710c59e1750774",
    "contract": null,
    "description": "<div>\n <p><b>Aneo</b> est une société de conseil hybride fondée en 2002, positionnée à la convergence du <b>conseil stratégique</b>, de l’<b>ingénierie logicielle avancée</b> et de l’<b>accompagnement à la transformation</b>.</p>\n <p>Nous intervenons sur des sujets à <b>haute intensité technologique</b>, où l’exigence technique et la <b>qualité du code</b> sont décisives : HPC, IA, GenAI, cloud, architectures distribuées, plateformes de calcul, progiciels critiques (Sophis, Orchestrade…), avec une expertise historique en <b>finance de marché (CIB)</b>.</p>\n <p>Nous intervenons auprès d’acteurs critiques bancaires, où nous sommes <b>référencés sur des projets IT</b> : risk engines, outils de pricing, trading platforms, cloud migration, refonte d’architectures legacy…</p>\n <p>Nous recherchons des développeurs expérimentés &amp; seniors qui veulent <b>comprendre comment les choses fonctionnent</b>, <b>challenger l’existant</b>, et <b>coder proprement</b>.</p>\n <p></p>\n <p><b> Vos missions (selon les projets)</b></p>\n <p>Au sein d’équipes pluridisciplinaires (PO, coach, dev, ops), vous contribuerez à la <b>construction et l’évolution de produits complexes</b>, en lien direct avec les utilisateurs et les métiers (Risk, FO, Innovation, etc.).</p>\n <ul>\n  <li><p><b> Développement de composants critiques</b> : moteurs de calculs, back-end de plateformes de trading électronique, outils de contrôle réglementaire, référentiels, middlewares, orchestrateurs cloud.</p></li>\n  <li><p><b> Approche produit</b> : implication dans les choix fonctionnels, <b>story mapping</b>, prototypage, challenge des user needs, participation active aux <b>démos utilisateurs</b>.</p></li>\n  <li><p><b> Excellence du code</b> : TDD, BDD, architecture hexagonale, revues de code systématiques, couverture de tests élevée, monitoring temps réel, exigences de performance élevées (batchs lourds, calculs temps réel…).</p></li>\n  <li><p><b> Engagement technique &amp; ownership</b> : vous contribuez aux choix d’architecture, à la construction de la CI/CD, à la documentation vivante et à la montée en compétence des plus juniors.</p></li>\n </ul>\n <p>Chaque mission est un terrain d’apprentissage et d’impact : vous êtes acteur de la qualité logicielle, du delivery, et de la cohérence globale du produit.</p>\n <p></p>\n <p><b> ️ Stack &amp; pratiques (selon contexte)</b></p>\n <ul>\n  <li><p>Langages : C#, Kotlin, Java, Node.js, Python, TypeScript</p></li>\n  <li><p>Cloud : AWS, GCP, Azure – K8s, Docker, Terraform</p></li>\n  <li><p>Archi : microservices, hexagonal, event-driven, REST/gRPC</p></li>\n  <li><p>Qualité : TDD, DDD, BDD, code review systématique, SonarQube</p></li>\n  <li><p>DevOps : GitLab CI, Jenkins, GitOps, observabilité</p></li>\n  <li><p>Spécificités : Sophis toolkit, ArmoniK, LLMs/GenAI, multithreading, SIMD</p></li>\n </ul>\n <p></p>\n <p><b> Infos pratiques</b></p>\n <ul>\n  <li><p>Rémunération : 44–75 K€</p></li>\n  <li><p>2 jours de télétravail</p></li>\n  <li><p>Notre siège est à Boulogne-Billancourt, nos clients en Île-de-France</p></li>\n </ul>\n <p></p>\n <p><b><br> Profil recherché</b></p>\n <ul>\n  <li><p>Bac+5 (école d’ingé ou équivalent), 3 d’expérience min en back-end ou fullstack</p></li>\n  <li><p>Solides bases en architecture logicielle, design patterns, testing</p></li>\n  <li><p>Exigence personnelle en matière de qualité de code, relecture, documentation</p></li>\n  <li><p>Goût pour l’Agilité, le travail en équipe produit, l’amélioration continue</p></li>\n  <li><p>Bonus : expérience en CIB, IA, biotech, projet open source ou cloud complexe</p></li>\n </ul>\n <p></p>\n <p><b> Pourquoi rejoindre Aneo ?</b></p>\n <ul>\n  <li><p>Une communauté de développeurs, d’ingénieur·es et de Ph.D passionné·es par la , le <b>HPC</b>, le <b>cloud</b> et l’<b>IA</b> passionnée par la performance et la qualité logicielle</p></li>\n  <li><p>Des projets à <b>fort enjeu business et technologique</b>, dans les systèmes cœur des banques d’investissement</p></li>\n  <li><p>Une expertise reconnue sur les <b>migrations cloud complexes</b> (AWS &amp; GCP), avec industrialisation de solutions <b>scalables</b> et <b>performantes</b></p></li>\n  <li><p>+4 % de la masse salariale dédiée à la <b>formation continue</b></p></li>\n  <li><p>Une gouvernance <b>horizontale</b>, avec <b>autonomie</b>, <b>responsabilisation</b> et <b>reconnaissance technique</b></p></li>\n  <li><p>Une <b>expérience collaborateur engagée</b> : séminaires d’expertise, mentoring, communautés internes, afterworks</p></li>\n </ul>\n <p></p>\n <p><b> Parcours de recrutement :</b></p>\n <ul>\n  <li><p><b> Pré-qualification</b> : entretien téléphonique (30 min max) pour valider l’intérêt mutuel</p></li>\n  <li><p><b> Entretien RH</b> : échange sur vos aspirations, votre parcours et votre adéquation culturelle</p></li>\n  <li><p><b> Entretien technique</b> : échange pour valider vos compétences avec l’un.e de nos consultant.es.</p></li>\n  <li><p><b> Entretien de projection</b> : échange avec un·e manager ou un directeur pour discuter de votre projection au sein du cabinet</p></li>\n </ul>\n <p><i> Au moins une des étapes se déroulera en présentiel.</i></p>\n <p></p>\n <p>Chez Aneo, chacun·e a sa place. Nous valorisons toutes les singularités et recrutons dans le respect de l’égalité des chances.</p>\n</div>\n<p></p>"
  },
  {
    "title": "Lead Dev Android - Paris 10e (75) - Indeed.com",
    "job_title": "Lead Dev Android",
    "jk": "4bd435105e175924",
    "company": "Tripndrive",
    "location": "Paris 10e (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=4bd435105e175924",
    "contract": null,
    "description": "Tripndrive\nNous sommes convaincus que le meilleur moyen de se déplacer est d'avoir une voiture juste quand on en a besoin. Uber, Autolib, et les transports en commun servent les déplacements courts et la proximité. Nous servons le reste. Tripndrive est un service fiable permettant de réserver simplement une voiture de qualité, stationnée à quelques minutes de là, facilement accessible, pour une fraction du prix. Nous simplifions la mobilité des particuliers et des entreprises et réduisons son coût en optimisant l'usage des véhicules grâce notre logiciel home made et des applications performantes.\nStartup d'une quinzaine de personnes dont 4 dev, nous aimons les technos innovantes, l’agilité et la bonne humeur.\nMieux nous connaître ...\nTon profil\nUn véritable\ncollaborateur\n, une personne\npassionnée\npar ce qu’elle fait et\nproactive\n:\nTu es issue d’une formation supérieure et possède au moins\n1 an d’expérience\ndans le développement Android.\nTu es curieux, tu t’intéresses aux\nnouvelles technologies\net tu aimes apprendre.\nTu souhaites prendre des\nresponsabilités\nau sein d’une startup en pleine croissance.\nTu maîtrise la stack\nAndroid\net outils :\nLifeCycle\n, Threading, Bonne pratiques UX, Dagger, Retrofit, ReactiveProgramming (\nRxJava)\n, RetroLambda (Java 8), Realm, \"\nClean Architecture\n\"\nLes plus :\nTu possèdes une bonne culture\nTechno Web\n(HTML5 / HTTP / API REST)\nTu aimes partager une bière (ou coca) pour fêter une nouvelle release\nTa mission\nEn tant que Lead dev Android, ta mission est de concevoir et développer l’application Tripndrive. Cette dernière a pour vocation de fournir toutes les fonctionnalités et l'UX nécessaires au parcours 100% mobile (réservation, chargement des documents, paiement, ouverture sans clé, géolocalisation, état des lieux, etc...)\nChez Tripndrive, pas de communication TopDown, tu seras le porteur du projet techniquement, tu auras à interagir avec les StackHolder, concevoir et faire des choix d'architecture de façon pragmatique et proactive.\nTrès bien, mais tu me diras \"dans la pratique je fais quoi ?\" ... et bien voici un exemple d'une journée :\nTu arrives le matin, prends un café :) A 10h daily SCRUM avec la team tech. Ce matin là tu décides de prendre une tâche sympa (\"Ouverture de la voiture via Bluetooth\"), coup d'oeil sur la spec, tu commences à réfléchir ... Il te manque des éléments ... Quelques minutes plus tard tu as Slacké le Stackholder pour compléter tes inputs.\n10h42, tu as tous les éléments et t'attaques à la conception, tu t'aperçois que la feature mérite de reprendre un existant modulo un refactoring, tu fais 2/3 schémas sur le whiteboard pour expliquer ta vue des choses. Ton choix est pragmatique et répond aux attentes, c'est validé (Tant mieux tu es un farouche combattant du legacy).\n11h13, tu commences par rédiger les test unitaires (tu es fan de TDD :p )\n12h27, nous mangeons tous ensembles (l'ambiance est très cool, au delà des dej, nous faisons régulièrement des pots et sorties)\n14h08, on rentre dans le dur, se pose alors des questions d'architectures ... Cela tombe bien, le meetup que tu avais prévu ce soir traite de ce sujet, tu profiteras de cet évènement ainsi que de la veille quotidienne, pour proposer des évolutions sur l'architecture de l'application.\n15h22, tu te rends compte qu'une problématique est commune avec l'application iOS, tu échangeras avec le Lead Dev iOS (on ne \"redesign\" pas la roue, et en plus c'est un passionné comme toi)\n17h18, tu laisses quelques commentaires sur Zeplin au Designer pour échanger sur la cinématique attendue\n18h37, tu fais une PullRequest en ayant pris soin de relire ton code\nAinsi seras ta mission si tu l'acceptes :)\nConditions\nDisponibilité : Dès que possible.\nLieu : Paris 10 ème.\nContrat : CDI.\nSalaire : A partir de 40K selon profil\nContact\nMerci d’envoyer ton CV et motivations à nicolas@tripndrive.com"
  },
  {
    "title": "Lead Developer (F/H) - 75018 Paris - Indeed.com",
    "job_title": "Lead Developer (F/H)",
    "jk": "834dbadd90ba3601",
    "company": "Scorp-io",
    "location": "75018 Paris",
    "canonical": "https://fr.indeed.com/viewjob?jk=834dbadd90ba3601",
    "contract": "CDI",
    "description": "À propos de SCorp-io\nSCorp-io est une plateforme cloud no-code innovante fondée en 2021, par 3 ingénieurs qui ont constaté que\n80% des dépenses d’énergies\ndes bâtiments tertiaires et industriels n’étaient pas optimisées.\nAujourd’hui, c’est\nune team de 15 personnes\nqui créent des applications de supervision sur-mesure, accessibles en temps réel et depuis n’importe quel appareil.\nNotre ambition :\nréduire de 30 % les émissions de CO₂\nliées aux consommations énergétiques en France. Pour y parvenir, nous innovons dans trois directions :\nDéveloppement produit : enrichissement fonctionnel continu\nDéveloppement commercial : nouveaux clients et partenaires\nIntégration : déploiement sur site de notre plateforme auprès de nos clients\nDescriptif du poste\nRattaché.e directement aux fondateurs, qui sont CTO et au VP Engineering, tu travailles au sein d’une équipe de trois développeurs seniors, accompagnée d’une équipe Produit et tu occuperas un rôle clé dans la coordination technique des projets en veillant à la\nqualité du code\n, à la\ncohérence des choix techniques\net à la\nbonne collaboration\nentre les équipes.\nLes missions\n:\nTon objectif sera de faire grandir la stack et l’équipe tout en garantissant la fiabilité et la performance de la plateforme. Tes missions seront :\nParticiper à la spécification fonctionnelle et technique\ndes nouvelles fonctionnalités, en lien étroit avec l’équipe Produit et les fondateurs,\nAssurer le développement\nde nouvelles fonctionnalités et l’\namélioration continue\ndes existantes,\nGarantir la qualité du code\n, la maintenabilité et la cohérence des architectures techniques, tout en contribuant activement à l’évolution des bonnes pratiques et guidelines internes,\nOptimiser et faire évoluer la plateforme\npour accompagner la forte croissance de SCorp-io (scalabilité, performance, résilience),\nEncadrer et accompagner les développeurs\n, en facilitant la montée en compétence et la collaboration au sein de l’équipe,\nRelayer le CTO et le VP Engineering\nsur la coordination technique du quotidien : suivi d’avancement, priorisation des sujets, support technique et animation des rituels d’équipe,\nChallenger les choix techniques\net proposer des améliorations pour renforcer la robustesse et la cohérence de l’écosystème technique,\nMaintenir une veille active\nsur les nouvelles technologies et tendances de l’écosystème startup, web et cloud.\nL'environnement technique\nPour ce faire, tu évolueras dans un environnement technique robuste\nFrontend\n: Angular, TypeScript, HTML, CSS, Tailwind\nBackend\n: Java, Spring Boot 3, Micronaut, Kafka\nBase de données\n: PostgreSQL, Warp10\nCloud & Infrastructure\n: Scaleway, Kubernetes, Crossplane\nCI/CD & Supervision\n: Bitbucket, SonarCloud, Argo CD, Prometheus, Grafana\nProfil recherché\nDe formation Ingénieur, tu es à l’aise dans les\nenvironnements techniques exigeants,\nTu as une solide expérience d\n’au moins 5 ans\nen tant que développeur,\nTu as déjà été amené à lead des équipes de dev, encadrer des projets et tu te considères comme\nun bon mentor\n,\nTu aimes t\nransmettre tes connaissances\n, partager ton expertise au profit d’une équipe,\nTu démontres un sens aigu de la\nqualité\n, de la\nperformance\net de la\nsécurité\ndu code,\nTu es à l’aise quand il s’agit de\nchallenger les choix techniques\net à proposer des solutions pragmatiques et durables,\nTu as un très bon relationnel,\nl’esprit d’équipe est important pour toi,\net tu sais travailler sur des\nprojets transverses avec d’autres métiers\n(DevOps, Produit, etc)\nTu as envie de t’investir pleinement dans un\nprojet à impact\nqui contribue à des consommations énergétiques plus saines et vertueuses.\nChez SCorp-io, on accorde\nautant d’importance à l’état d’esprit qu’aux compétences techniques\n. Si tu fais preuve de\nmotivation, de curiosité et de bienveillance\n, et que tu veux contribuer à\nréinventer la GTB tout en ayant un impact positif sur l’environnemen\nt, on veut te rencontrer. Même si tu ne coches pas toutes les cases techniques.\nPourquoi nous rejoindre ?\nUne politique de\ntélétravail flexible\n,\nIntégrer une startup qui n’en est qu’au\ndébut de sa croissance\n,\nPrendre un\nposte évolutif\n, au sein d’une équipe qui favorise le travail collaboratif\nL’opportunité de s’investir dans\nun projet à impact positif\n,\nContribuer à la digitalisation et à la décarbonation du secteur historique du bâtiment.\nInfos pratiques\nLocalisation : Paris 18\nDate de démarrage : ASAP\nContrat : CDI - Statut Cadre\nSalaire annuel : selon profil\nPrime vacances\nProcessus de recrutement\nUn premier échange avec Anthony, Responsable du recrutement,\nUn entretien avec Bastien, VP Engineering,\nUn exercice/cas pratique.\nType d'emploi : Temps plein, CDI\nRémunération : 60 000,00€ à 70 000,00€ par an\nLieu du poste : Télétravail hybride (75018 Paris)"
  },
  {
    "title": "Business Analyst H/F - 75007 Paris - Indeed.com",
    "job_title": "Business Analyst H/F",
    "jk": "d1bd32522755b416",
    "company": "TimTek",
    "location": "75007 Paris",
    "canonical": "https://fr.indeed.com/viewjob?jk=d1bd32522755b416",
    "contract": "CDI",
    "description": "<p><b>TimTek est une entreprise à mi-chemin entre l'incubateur et l'ESN, dont les objectifs sont multiples.</b></p>\n<p>Tout d'abord, nous développons une activité de prestation intellectuelle dans le domaine IT autour de 4 sujets :</p>\n<ul>\n <li><b>Développement :</b> Java, PHP, C#, Javascript et tous leurs frameworks.</li>\n <li><b>Infrastructure :</b> Cloud, Devops, Architecture, Administration systèmes et réseaux.</li>\n <li><b>Data : </b>Business Intelligence, Data Science, Big Data, Data Analysis, Data Engineering.</li>\n <li><b>Fonctionnel </b>: Gestion de projet, Consultant fonctionnel</li>\n</ul>\n<p>Dans un second temps, nous réinvestissons l'ensemble des bénéfices afin d'autofinancer le lancement de projets digitaux innovants qui ont un rapport avec la RSE (intérêt général, écologie ou autre).</p>\n<p>Ainsi, nous rassemblons aujourd'hui <b>une communauté de 50 consultants entreprenants et notre objectif est de continuer cette croissance en vous présentant des projets de qualité.</b></p>\n<p>Aujourd'hui, nous sommes à la recherche d’un <b>Business Analyst (H/F)</b> pour intégrer nos équipes sur Paris.</p>\n<p><b>Responsabilités</b></p>\n<ul>\n <li>Evaluer les impacts des Etudes d’Opportunités réalisées sur les processus et outils</li>\n <li>Cadrer fonctionnellement les chantiers</li>\n <li>Communiquer et suivre les chantiers avec le Pôle Utilisateur</li>\n <li>Assister le PU et accompagner les CR durant les déploiements</li>\n <li>Construire la stratégie de test, procéder à la mise à jour du patrimoine de tests et les exécuter (XRAY),</li>\n <li>Construire la stratégie de test, piloter et exécuter la recette fonctionnelle</li>\n <li>Rédiger les récits fonctionnels et les présenter à l'équipe de dev.</li>\n <li>Participer aux activités de support : prise en compte de demande, analyse, réponse, post mortem.</li>\n</ul>\n<p><b>Profil recherché</b> :</p>\n<ul>\n <li>Capacité d'analyse des besoins, de formalisation et de transformation en solution.</li>\n <li>Capacité de travail en équipe avec différents profils d'acteurs (utilisateurs en CR, IT, architectes, ...),</li>\n <li>Autonomie et force de proposition, prendre en charge des sujets nouveaux nécessitant une démarche spécifique d'ouverture et de cadrage.</li>\n <li>Communication.</li>\n <li>Rigueur et méthodologie : animation d’atelier, interviews utilisateurs, approche processus, rédaction de récits, rédaction et exécution de tests</li>\n</ul>\n<p><b>Autres :</b></p>\n<ul>\n <li>RTT</li>\n <li>Tickets restaurant</li>\n <li>CE</li>\n <li>Incubateur de projets</li>\n <li>Soirées d'entreprise (escape game, restaurant, sport...)</li>\n <li>300€ / an de remboursement pour les frais liés au sport</li>\n</ul>\n<p>L’aventure TimTek vous intéresse, alors n'hésitez pas à nous envoyer votre candidature. :-)</p>\n<p>Type d'emploi : Temps plein, CDI</p>\n<p>Rémunération&nbsp;: 40 000,00€&nbsp;à&nbsp;45 000,00€&nbsp;par an</p>\n<p>Avantages&nbsp;:</p>\n<ul>\n <li>Prise en charge du transport quotidien</li>\n <li>Réductions tarifaires</li>\n <li>RTT</li>\n</ul>\n<p>Lieu du poste : Télétravail hybride (75007 Paris)</p>"
  },
  {
    "title": "3A Software Development Internship – POC to replace Hibernate - 75116 Paris - Indeed.com",
    "job_title": "3A Software Development Internship – POC to replace Hibernate",
    "jk": "8622b36a9d8d0f51",
    "company": "Murex",
    "location": "75116 Paris",
    "canonical": "https://fr.indeed.com/viewjob?jk=8622b36a9d8d0f51",
    "contract": null,
    "description": "<div>\n <div>\n  Murex is a global fintech leader in trading, risk management and processing solutions for capital markets.\n </div>\n <div>\n  Operating from our 19 offices, 3 400 Murexians from over 65 different nationalities ensure the development, implementation and support of our platform which is used by banks, asset managers, corporations and utilities, across the world.\n </div>\n <div>\n  Join Murex and work on the challenges of an industry at the forefront of innovation and thrive in a people-centric environment. You’ll be part of one global team where you can learn fast and stay true to yourself.\n </div>\n <div></div>\n <div>\n  <div>\n   <div>\n    <br> Team &amp; Context:\n   </div>\n   <div></div>\n   <div>\n    You’ll be part of the Datalayer team, a team of 8 people mainly based in Paris.\n   </div>\n   <div>\n    Our team is part of the Platform Technologies group which aims to address the technical and technological challenges of the MX.3 platform.\n   </div>\n   <div>\n    One of its goals is to provide the financial developers with robust and highly efficient SDKs to abstract the supported relational databases (Oracle, PostgreSQL, …) in both Java and C++.\n   </div>\n   <div>\n    The Java one heavily relies on the Hibernate third party which is a well-known JPA implementation.\n   </div>\n   <div>\n    Our problem is that the Hibernate upgrades have become increasingly more complex and costly, to a point where we’re now considering moving away from it…\n   </div>\n   <div>\n    This is a strategic objective for the company.\n   </div>\n   <div></div>\n   <div>\n    Missions:\n   </div>\n   <div></div>\n   <div>\n    As a Java Developer your mission will be to:\n   </div>\n   <ul>\n    <li>\n     <div>\n      Assess the current usage of Hibernate in the MX.3 platform\n     </div></li>\n    <li>\n     <div>\n      Study other third parties that could replace Hibernate and do a Proof of Concept (POC) with the most promising one\n     </div></li>\n    <li>\n     <div>\n      Assess the cost of implementing the JPA specification internally as a replacement for Hibernate\n     </div></li>\n    <li>\n     <div>\n      Design and document a migration plan\n     </div></li>\n   </ul>\n   <div></div>\n   <div>\n    Profile:\n   </div>\n   <div></div>\n   <div>\n    <i> « Mandatory » skills:</i>\n   </div>\n   <ul>\n    <li>\n     <div>\n      Student (Bac+5, preferably from an engineering school) looking for a final internship of 6 months\n     </div></li>\n    <li>\n     <div>\n      Solid knowledge of Java, RDBMS and SQL\n     </div></li>\n    <li>\n     <div>\n      Autonomy, ability to work independently\n     </div></li>\n    <li>\n     <div>\n      Strong problem-solving mindset\n     </div></li>\n    <li>\n     <div>\n      Excellent written and oral communication in French and/or English\n     </div></li>\n    <li>\n     <div>\n      Team spirit and collaboration\n     </div></li>\n   </ul>\n   <div></div>\n   <div>\n    <i> « Nice to have » skills:</i>\n   </div>\n   <ul>\n    <li>\n     <div>\n      Knowledge of JPA, ORM and Hibernate\n     </div></li>\n    <li>\n     <div>\n      Knowledge of version control tools (Git) and continuous integration tools (Jenkins)\n     </div></li>\n   </ul>\n   <div></div>\n   <div>\n    Why join us ?\n   </div>\n   <div></div>\n   <div>\n    By joining the DEV domain teams, you seize the unique opportunity to combine software publishing, capital markets, and cutting-edge development:\n   </div>\n   <ul>\n    <li>\n     <div>\n      Be part of a community of experts motivated by challenges and innovation, contributing to the continuous improvement of the MX.3 platform\n     </div></li>\n    <li>\n     <div>\n      Benefit from quality onboarding training covering various functional, technical, and interpersonal skills\n     </div></li>\n    <li>\n     <div>\n      Grow in an agile, international, multicultural, and expanding environment\n     </div></li>\n   </ul>\n  </div>\n </div>\n</div>\n<div></div>"
  },
  {
    "title": "Architecte Applicatif / Technique - Paris (75) - Indeed.com",
    "job_title": "Architecte Applicatif / Technique",
    "jk": "6be543685d92d856",
    "company": "Clever Age",
    "location": "Paris (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=6be543685d92d856",
    "contract": null,
    "description": "Nous renforçons nos équipes et recherchons un Architecte Applicatif\nClever Age est une agence full service\ncouvrant la totalité de la chaine du digital\n. Depuis 2001, c’est notre\nindépendance\nqui nous caractérise et nous démarque. Notre agence compte 450 collaborateurs, répartis au sein d’agences à taille humaine en France (Paris, Lyon, Nantes, Bordeaux, Toulouse, Lille et Marseille) et à l’international comme à Montréal, Hong-Kong, Singapour et Ho Chi Minh.\nPrésents à l’occasion de nombreuses conférences sur des problématiques Web, nous aimons partager notre expertise avec d’autres professionnels du digital.\nNos développeurs sont des passionnées du Web et Clever Age mettent un point d’honneur à entretenir cette passion en restant à l’écoute de leur souhait d’évolution de carrière. Nous sommes garants des\nbonnes pratiques\ndu Web et permettons à nos développeurs d’obtenir la\ncertification Opquast\n.\nCertains que la cohésion d’équipe est notre force, nous organisons des événements conviviaux afin que les équipes se rencontrent, échangent sur des problématiques Web, mais pas que…\nVous souhaitez tenter l’expérience Clever Age et nous rejoindre ?\nVous êtes curieux, enthousiaste à l’idée de travailler sur des projets d’envergure.\nVous souhaitez rejoindre une équipe dynamique dont l’échange et le partage des connaissances sont les principales valeurs.\nVous voulez évoluer au sein d’une agence pouvant vous offrir des perspectives de carrières nationales et internationales ?\nAlors n’hésitez pas, postulez et rejoignez notre équipe !\nPROFIL\nVous avez une solide expérience en architecture applicative, avec une expertise approfondie en conception et implémentation de solutions complexes\nVous avez une maîtrise des modèles d’architecture modernes, notamment Microservices, Serverless, et Event-Driven Architecture\nVous avez une expertise en technologies de développement et frameworks tels que Java, .NET, Node.js, et Python\nVous avez une connaissance avancée des plateformes de cloud computing (AWS, Azure, GCP) et des services associés (Lambda, Kubernetes, Docker)\nUne Expérience approfondie avec les bases de données relationnelles est évidente(PostgreSQL, MySQL) et NoSQL (MongoDB, Cassandra)\nVous avez des expériences en architecture de microservices et en conteneurisation\nConnaissance des protocoles de communication et des API (REST, GraphQL, gRPC)\nLa Maîtrise des pratiques de sécurité est indissociable de votre métier (OWASP, gestion des identités et des accès)\nVous maitrisez les outils de la chaine CI/CD et l’environnement dev\nVous baignez dans la Philosophie Devops et toute forme d’agilité\nVous incarnez la méthodologie de tests des environnements techniques et êtes fédérateur des outils utilisés (TDD, DDD…)\nVous êtes un profil fédérateur capable de porter la montée en compétence de l’équipe\nVous avez les bonnes pratiques Opqast\nMISSIONS\nConcevoir l’architecture technique des projets en utilisant des frameworks front-end (React, Angular, Vue.js) et back-end (Spring, Django, Express.js)\nDéfinir et mettre en place les bases de données relationnelles (PostgreSQL, MySQL) et NoSQL (MongoDB, Cassandra)\nArchitecturer des solutions de microservices, en utilisant des technologies de conteneurisation (Docker, Kubernetes)\nMettre en œuvre des pratiques DevOps et des pipelines CI/CD (Jenkins, GitLab CI)\nIntégrer et déployer des applications sur des plateformes cloud (AWS, Azure, Google Cloud)\nAssurer la sécurité des applications en appliquant les pratiques recommandées (OWASP, IAM)\nDéfinir et documenter les spécifications techniques et les schémas d’architecture\nCollaborer avec les équipes de développement pour s’assurer de l’alignement avec l’architecture définie\nRéaliser des revues de code et des audits techniques pour garantir la qualité et la conformité"
  },
  {
    "title": "Senior Java Active Pivot Risk Developer (H/F) (Ref : ALE-279) - 92974 La Défense - Indeed.com",
    "job_title": "Senior Java Active Pivot Risk Developer (H/F) (Ref : ALE-279)",
    "jk": "81311bd3675df7d6",
    "company": "Alfic",
    "location": "92974 La Défense",
    "canonical": "https://fr.indeed.com/viewjob?jk=81311bd3675df7d6",
    "contract": null,
    "description": "Afin d’accompagner l’un de nos clients, banque d’investissement internationale, nous recherchons un développeur Java sénior.\nVos principales missions seront de :\n– Enrichir les Services Risques sur des projets réglementaires\n– Optimiser les calculs et la gestion de la mémoire\n– Migrer l’application sur Active Pivot 5\n– Concevoir et implémenter de nouvelles fonctionnalités\n– Concevoir, implémenter et assurer le suivi des UAT\nDe formation d’ingénieur ou Bac+5 vous justifiez d’une expérience de 5 à 10 ans.\n– Vous avez déjà travaillé sur les produits dérivés, de préférence sur les dérivés actions\n– Vous connaissez très bien Active Pivot\n– Vous avez une expérience significative sur l’optimisation (JVM…)\n– Vous êtes à l’aise avec le framework Spring\n– Vous avez une bonne pratique de méthodologies de dev : agile, intégration continue,\n– Vous connaissez Tomcat\n– La connaissance d’Hadoop serait un plus\n– Vous maîtrisez l’anglais aussi bien à l’écrit qu’à l’oral\nAu-delà des compétences techniques ou fonctionnelles de nos collaborateurs, nous attachons une très grande importance à la personnalité de chacun.\nOuverture aux autres, qualités de contact, sens du travail en équipe, enthousiasme et énergie, générosité et sens de l’engagement."
  },
  {
    "title": "DevOps Manager - Paris (75) - Indeed.com",
    "job_title": "DevOps Manager",
    "jk": "ec1a3ddefa8c1785",
    "company": "Finastra",
    "location": "Paris (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=ec1a3ddefa8c1785",
    "contract": null,
    "description": "<div>\n <h1 class=\"jobSectionHeader\"><b>Who are we?<br> </b></h1>\n <p><br> At Finastra, we are a dynamic global provider of open finance software solutions, dedicated to expanding access to financial services. Our innovative applications span Lending, Payments, Treasury and Capital Markets, and Universal Banking. Proudly serving over 8,000 customers, including 45 of the world's top 50 banks, we aim to boost financial inclusion for all. Join us and be part of a vibrant company that embraces diverse perspectives, and is committed to doing well by doing good.</p>\n <p></p>\n <div>\n  <div>\n   <p>We are looking for a hands-on DevOps Manager focusing on one of our flagship Treasury and Capital Markets product.<br></p>\n  </div>\n  <div>\n   <p><br> This product is a Finastra’s front-to-back treasury and capital markets solution, designed to support global investment banks and financial institutions. With over 25 years of market expertise, it enables efficient trading, risk management, and compliance across a wide range of asset classes. It offers a modular architecture, real-time decision-making tools, and seamless integration with market data providers like Bloomberg and Refinitiv. Built for flexibility and scalability, it supports rapid product innovation and straight-through processing (STP), helping institutions reduce costs and accelerate time to market<br></p>\n  </div>\n  <p></p>\n  <div>\n   <p>The DevOps Manager, in constant connection with his team, R&amp;D teams, IT and CISO teams, is responsible, from source code to packages, for the reliable and efficient automated processes that build, scan, test and deliver product to customers.</p>\n  </div>\n  <div>\n   <p>Key Responsibilities</p>\n  </div>\n  <div>\n   <ul>\n    <li><p>Manage and grow a team of 3 + DevOps Engineers</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Lead the modernization of CI/CD pipelines and self-service tools on Azure</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Apply agile and iterative methodologies to all deliverables</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Drive automation and continuous improvement to accelerate and improve time to delivery and user experience</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Support R&amp;D teams with DevOps services and tools</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Explore and implement emerging DevOps tools and industry standards</p></li>\n   </ul>\n  </div>\n  <div>\n   <p>Required Experience</p>\n  </div>\n  <div>\n   <ul>\n    <li><p>6 + years in a Dev/DevOps role</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>1 + years in a DevOps team management position</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Bachelor’s or Master’s degree in Computer Science</p></li>\n   </ul>\n  </div>\n  <div>\n   <p>Technical Skills</p>\n  </div>\n  <div>\n   <ul>\n    <li><p>Hands-on experience with Docker, Helm, Kubernetes, and public cloud platforms (Azure/AWS)</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Proficiency in Python, Shell scripting, Groovy, Java</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Experience developing CI/CD pipelines as code with quality gates</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Strong production mindset and customer support orientation</p></li>\n   </ul>\n  </div>\n </div>\n <div>\n  <div>\n   <ul>\n    <li><p>Azure certifications preferred</p></li>\n   </ul>\n  </div>\n  <div>\n   <p>Soft Skills</p>\n  </div>\n  <div>\n   <ul>\n    <li><p>Experience working in multicultural environments (Europe, US, Asia)</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Excellent communication and reporting skills</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Proven track record in Agile project delivery (SAFE/Scrum, JIRA)</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Fluent in English (written and spoken)</p></li>\n   </ul>\n  </div>\n  <div>\n   <p>Why Join Us</p>\n  </div>\n  <div>\n   <ul>\n    <li><p>Be part of a global fintech leader</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Drive innovation in a cloud-first environment</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Collaborate with a diverse, international team</p></li>\n   </ul>\n  </div>\n  <div>\n   <ul>\n    <li><p>Enjoy a flexible, hybrid work model</p></li>\n   </ul>\n  </div>\n </div>\n <p></p>\n <p>We are proud to offer a range of incentives to our employees worldwide. These benefits are available to everyone, regardless of grade, and reflect the values we uphold:<br></p>\n <p></p><br>\n <p>· <b>Flexibility: </b>Enjoy unlimited vacation, based on your location and business priorities. Hybrid working arrangements, and inclusive policies such as paid time off for voting, bereavement, and sick leave.</p>\n <p>· <b>Well-being: </b>Access confidential one-on-one therapy through our Employee Assistance Program, unlimited personalized coaching via our coaching app, and access to our Gather Groups for emotional and mental support.</p>\n <p>· Medical, life &amp; disability insurance, retirement plan, lifestyle and other benefits*</p>\n <p>· <b>ESG: </b>Benefit from paid time off for volunteering and donation matching.</p>\n <p>· <b>DEI: </b>Participate in multiple DE&amp;I groups for open involvement (e.g., Count Me In, Culture@Finastra, Proud@Finastra, Disabilities@Finastra, Women@Finastra).</p>\n <p>· <b>Career Development: </b>Access online learning and accredited courses through our Skills &amp; Career Navigator tool.</p>\n <p>· <b>Recognition </b>: Be part of our global recognition program, Finastra Celebrates, and contribute to regular employee surveys to help shape Finastra and foster a culture where everyone is engaged and empowered to perform at their best.<br></p>\n <div>\n  <br>\n  <ul>\n   <li>Specific benefits may vary by location.</li>\n  </ul>\n </div>\n <p></p>\n <p>At Finastra, each individual is unique, bringing their own ideas, thoughts, cultural beliefs, backgrounds, and experiences together. We learn from one another, embrace and celebrate our differences, and create an environment where everyone feels safe to be themselves.</p>\n <p></p>\n <p>Be unique, be exceptional, and help us make a difference at Finastra!</p>\n</div>"
  },
  {
    "title": "Tech Lead Java F/H - 92800 Puteaux - Indeed.com",
    "job_title": "Tech Lead Java F/H",
    "jk": "43fd1907cbb0c8a8",
    "company": "Generix Group",
    "location": "92800 Puteaux",
    "canonical": "https://fr.indeed.com/viewjob?jk=43fd1907cbb0c8a8",
    "contract": null,
    "description": "<div>\n <b>Description de l'entreprise</b>\n <p><br> Generix Group est un éditeur SaaS, leader des solutions de Supply Chain Collaborative qui facilitent les échanges de biens et de données dans le monde entier, entre fournisseurs et clients, en pilotant l’ensemble de leurs flux, de manière responsable. Sa plateforme de services digitaux innovants permet d’optimiser la gestion des flux physiques, en coordonnant l’ensemble du processus d'approvisionnement, de la production à la livraison grâce à ses solutions WMS, TMS, RMS et VMI ; mais aussi des flux logiques et financiers, en intégrant les systèmes de tous les acteurs de la chaîne, de la commande à son règlement, avec ses solutions d’e-invoicing, e-reporting, EDI, P2P et O2C.</p>\n <p>Generix Group crée un écosystème unique au service de ses clients, garantissant performance et durabilité, permettant de connecter l’ensemble des acteurs mondiaux du commerce, de l’industrie et des services, pour favoriser la transition vers plus de sobriété numérique et énergétique.</p>\n <p>Avec près de 850 collaborateurs, Generix Group accompagne au quotidien plus de 4500 entreprises dans plus de 60 pays, comme Carrefour, Danone, FM Logistic, Fnac Darty, Essilor et Ferrero, et traite chaque année plus de 500 millions de factures, plus de 40 millions de lignes de commandes chaque mois ou encore 8 millions de messages EDI par jour.</p><b><br> Description du poste</b>\n <p><br> Au sein de l’équipe de développement TradeXpress EDI, le Tech Lead est un développeur expérimenté et leader technique. Il participe aux activités de développement, apporte son expertise technique, oriente les choix technologiques et de design logiciel et s’assure des bonnes pratiques de développement.</p>\n <p>Le Tech Lead est un membre à part entière de l’équipe agile. Il collabore étroitement avec les autres membres de l’équipe (Dev, QA et SM), avec le PO et l’architecte pour comprendre au mieux les besoins afin d’orienter les bons choix technologiques</p>\n <p>L’application TradeXpress est une application legacy en cours de modernisation. Le but est d’accompagner et renforcer cette modernisation : évolutions techniques, adoption de nouvelles technologies, mise en place de bonnes pratiques et accompagnement.</p>\n <ul>\n  <li>Développement logiciel</li>\n  <li>Revue de code</li>\n  <li>Design applicatif, participation aux choix technologique</li>\n  <li>Coaching et accompagnement technique</li>\n  <li>Participation aux analyses d’anomalies et à la correction de bug</li>\n  <li>Revue des users stories et définition du design avant début implémentation</li>\n  <li>Participation active au chiffrage des features</li>\n </ul>\n <p>Les missions précitées ne sont pas exhaustives et restent évolutives</p><b><br> Qualifications</b>\n <p><br> De formation Bac+5 en informatique, vous détenez une expérience confirmée de 5 ans minimum sur un poste similaire.</p>\n <p>Vous êtes reconnu(e) pour vos connaissances en Java et Angular. Vous connaissez les pratiques de développement : cloud, containerisation, centralisation des logs, industrialisation des déploiements, scalabilité, multi-tenancy.</p>\n <p>Vous avez aussi des connaissances dans l'EDI (l'échange de données informatisées), et la connaissance du produit TradeXpress est un vrai plus.</p>\n <p>Vous détenez une très bonne maitrise des méthodologies Agile et Scrum.</p>\n <p>Langages de programmation : Java (Spring, SpringBoot) et Angular. Connaissance du C</p>\n <p>Technologies : Postgres, Docker, AWS, Azure, S3, Flyway, Keycloak, Linux, MQ (Series / Rabbit), Kafka, API rest/JSON/OAS</p>\n <p>Outils : Jira, Git, Jenkins, Entreprise Architect, UML, Swagger, Maven, Nexus</p>\n <p>Rigoureux(se), organisé(e), leadership technique, capacité à convaincre et accompagner, capacité d'écoute et d'analyse, vous êtes reconnu(e) pour votre capacité à apprendre rapidement des systèmes complexes et techniques, tout en étant pragmatique.</p>\n <p>La maitrise de l'anglais est nécessaire.</p><b><br> Informations supplémentaires</b>\n <p></p>\n <p><i><br> Generix Group est une entreprise handi-accueillante : à compétences égales, tous nos postes sont ouverts aux personnes en situation de handicap.</i></p>\n <p><i> Generix Group traite vos données à caractère personnel dans le cadre de la gestion de votre candidature. Vous disposez d’un droit d’accès, de rectification, de suppression et d’opposition relatif aux informations vous concernant. Pour cela, merci d’envoyer votre demande à dpo@generixgroup.com. Vous trouverez plus d’informations dans la Politique de protection des données accessibles sur </i><i>www.generixgroup.com.</i></p>\n</div>"
  },
  {
    "title": "Snr Penetration Tester - IT/OT - Paris (75) - Indeed.com",
    "job_title": "Snr Penetration Tester",
    "jk": "547f8d585059a568",
    "company": "Integrity360",
    "location": "IT/OT",
    "canonical": "https://fr.indeed.com/viewjob?jk=547f8d585059a568",
    "contract": null,
    "description": "<div>\n <p><b>About Us</b></p>\n <p>Integrity360 is the largest independent cyber security provider in Europe, with a growing international presence spanning the UK, Ireland, mainland Europe, Africa and the Caribbean. With over 700 employees, across 12 locations, and six Security Operations Centres (SOCs)—including locations in Dublin, Sofia, Stockholm, Madrid, Rome and Cape Town—we support more than 2,500 clients across a wide range of industries.</p>\n <p></p>\n <p><br> Over 80% of our team are technical experts, focused on helping clients proactively identify, protect, detect and respond to threats in an ever-evolving cyber landscape. Our security-first approach positions cyber resilience as a business enabler, empowering organisations to operate with confidence.</p>\n <p></p>\n <p><br> At Integrity360, people come first. We invest heavily in learning, development and progression, fostering a dynamic culture where innovation, collaboration and continuous growth are at the heart of what we do. If you're ready to take your cyber security career to the next level, we’d love to hear from you.</p>\n <p></p>\n <p><b><br> Role Overview</b></p>\n <p>We’re looking for a <b>Penetration Tester with at least 5 years of real-world professional experience</b>, fully independent, with consultancy and tutoring skills and experience. Previous experience in management is strongly recommended.</p>\n <p></p>\n <p><br> In this role, you’ll support and deliver testing projects (web, infra, cloud, AD, and mobile and not limited to), guided by experienced technical leaders. You’ll be involved in pre-sales activities, travelling onsite on customer environments and delivering high quality services.</p>\n <p></p>\n <p><b><br> Job Role / Responsibilities</b></p>\n <p>As a Pentest manager, you will deliver advanced penetration testing and security assessments across a wide range of environments and technologies. You will also contribute to internal capability development, collaborate with other departments, and represent Integrity360 in client engagements and technical forums.</p>\n <p></p>\n <p><br> You will be responsible for managing a small team of consultants within the Offensive Security division. You will ensure the success of various missions by ensuring the quality of deliverables. You will also be responsible for developing the skills and monitoring your consultants.</p>\n <p>This role blends deep technical expertise with excellent communication and documentation skills.</p>\n <p></p>\n <p><b><br> Core Responsibilities:</b></p>\n <p><b> Security Testing &amp; Delivery</b></p>\n <ul>\n  <li>Perform advanced manual penetration tests and technical security assessments (web, mobile, infrastructure, cloud).</li>\n  <li>Execute Red Team or assumed breach engagements as part of a team or independently.</li>\n  <li>Identify, exploit, and document vulnerabilities in complex systems, clearly articulating risk and remediation to stakeholders.</li>\n  <li>Review application architectures and source code for security weaknesses.</li>\n </ul>\n <p><b>Reporting &amp; Communication</b></p>\n <ul>\n  <li>Produce high-quality technical reports and executive summaries tailored to various audiences.</li>\n  <li>Present findings to clients and internal stakeholders in a clear and professional manner.</li>\n </ul>\n <p><b>Research &amp; Innovation</b></p>\n <ul>\n  <li>Continuously research new vulnerabilities, attack techniques, and tools to stay ahead of evolving threats.</li>\n  <li>Contribute to the development of internal methodologies, tools, and automation scripts.</li>\n </ul>\n <p><b>Internal Support &amp; Mentoring</b></p>\n <ul>\n  <li>Manage a small team of consultants (ensure that their activities are carried out correctly, review their deliverables, monitor their skills development, perform 1 to 1)</li>\n  <li>Support the testing team in delivery planning, documentation, and knowledge sharing.</li>\n </ul>\n <p><b>Cross-Team Collaboration</b></p>\n <ul>\n  <li>Work closely with SDMs, Project Managers, and other technical teams to ensure smooth delivery.</li>\n  <li>Support Sales and Marketing teams with technical insights for proposals, events, or webinars when needed.</li>\n </ul><br>\n <p></p>\n <p><b> Desired Skills</b></p>\n <ul>\n  <li>Solid experience in information security</li>\n  <li>Industry experience working in Dev/Admin/Engineer field</li>\n  <li>Industry experience working in Information security field as a penetration tester</li>\n  <li>First Industry experience working as Pentest Manager</li>\n  <li>First Industry experience working in OT environment</li>\n  <li>Development and/or source code review experience in C/C++, C#, VB.NET, ASP, PHP, Java, Python or Ruby</li>\n  <li>Strong Unix, Windows and networking security skills</li>\n  <li>Familiarity with general application and network security concepts</li>\n  <li>Excellent communication skills</li>\n  <li>Manual penetration testing experience above and beyond running automated tools</li>\n  <li>Experience developing custom scripts or tools used for vulnerability scanning and identification</li>\n </ul>\n <ul>\n  <li>In depth networking knowledge (ports, protocols, firewalls, routing, VPN, MPLS, BGP, OSPF, IPv6, TOR)</li>\n  <li>Report writing experience</li>\n  <li>Presentation skills</li>\n  <li>Scripting/coding, sys admin or networking experience</li>\n  <li>Understanding of quality management and project management principles</li>\n </ul>\n <ul>\n  <li>Desire to learn and progress in the field of offensive security</li>\n  <li>Passionate about penetration testing</li>\n  <li>Availability and autonomy to travel within France, Europe, and abroad</li>\n  <li>Ability to work in a team and have a sense of community</li>\n  <li>Operational rigor and a commitment to quality in execution</li>\n  <li>Analytical and critical thinking</li>\n  <li>Ability to solve problems</li>\n  <li>Efficient, persistent, and detail-oriented</li>\n  <li>Ability to explain and provide advice</li>\n  <li>Strong customer relations skills</li>\n </ul><br>\n <p></p>\n <p><b> Certifications/Qualifications</b></p>\n <ul>\n  <li>Security Clearance or local vetting (as required by region or client sector)</li>\n  <li>Relevant certifications such as OSCP, OSCE, OSEP, CRTO, CREST, or equivalent</li>\n  <li>Bachelor’s degree in Computer Science, Cybersecurity, or related field (or equivalent hands-on experience)</li>\n  <li>Have a B license and a passport</li>\n </ul><br>\n <p></p>\n <p>#LI-PM2</p>\n</div>"
  },
  {
    "title": "Responsable Centre de service - Client final H/F - Boulogne-Billancourt (92) - Indeed.com",
    "job_title": "Responsable Centre de service",
    "jk": "d8bb500edea4a496",
    "company": "Mindset",
    "location": "Client final H/F",
    "canonical": "https://fr.indeed.com/viewjob?jk=d8bb500edea4a496",
    "contract": null,
    "description": "Présentation de la société qui recrute et contexte de la recherche\nMindset\n, cabinet de Recrutement Expert en SI, Digital et IT, recherche pour le compte d'un acteur majeur du secteur du numérique et de l’audiovisuel un\nResponsable des Centres de Services (Client Final ) H/F.\nRejoignez une DSI en pleine phase de transformation qui lance un ambitieux plan de transformation\nMissions proposées\nRejoignez une DSI en pleine phase de transformation qui lance un ambitieux plan de transformation\nMissions :\nLa DSI recherche un Responsable /Pilote de centres de service SI.( 3 centres de services , représentant un total d'environ 60 ETPs) ( Digital Factory + Datacenter )\nVous êtes le garant de la performance des centres de services de développement logiciel ( CDS, CDC) et en êtes le point de contact principal et le manager de la relation,\nEn tant que Responsable des centres de services applicatifs, vous :\nAssurez le pilotage économique des prestations et vous garantissez la bonne application du PAQ, PRA,\nParticipez au cycle de vie des contrats (établissement, avenants, renégociations, terminaison.)\nSuivez et consolidez les indicateurs contractuels (KPI, SLA) via des tableaux de bord.\nAssurez l'optimisation du staffing pour une efficacité maximale.\nMettez en place et assurez le suivi des indicateurs de l’activité contractuelle\nAnimez les comités contractuels avec les prestataires, avec un suivi des risques, des arbitrages.\nRéalisez le suivi des commandes, de la facturation et des engagements financiers\nProposez les améliorations de la performance des contrats : plans d'action, plans d'amélioration continue, démarche lean…\nAlertez la direction en cas de dérives et proposer des axes de progrès\nVérifiez l’acquisition par le fournisseur des compétences nécessaires à la fourniture du service, notamment la montrée en compétence vers l'agilité et le Devops\nPilotez économiquement les prestations en respectant les cadres de référence et de sécurité\nSuivez l’avancement des projet (participation aux comités de pilotage / suivi projet, comité sécurité, revues de jalons…)\nVeiller à l'application des normes et politiques internes par le centre de service\nContribuez à l’amélioration des processus de développement SI et d’intégration et déploiement continus.\nVous assurez l’accompagnement du changement en interne vers les nouveaux modes de fonctionnements induits par les centres de services, dont notamment les méthodes agiles.\nVous avez également comme responsabilité la création de lien opérationnel entre les centres de service et la DSI, et l'acculturation des équipes de centre de service à l'agilité ( Scrum , PO, devs)\nEnvironnement techniques et outils :\nJira\nCI/CD\nJava\nJavascript\nMicrosoft\nLinux\nProfil du candidat et compétences requises\nBac+5 minimum, avec 5 ans minimum\nMaîtrise des méthodologies de gestion de projet : Cycle en V et Agiles (Scrum)., idéalement,\nBonne connaissance en ingénierie logicielle\nExpérience significative dans la transition vers des méthodologies agiles pour les centres de service et la TMA.\nEnvie d'animer et guider la communauté agile, incluant les Product Owners, les Scrum Masters.\nAptitude à créer des relations solides entre les équipes et les parties prenantes.\nIdéalement, une expérience antérieure en tant que Delivery Manager ou en tant que Responsable de centre de services\nNiveau de rémunération :\n75000 euros en fixe + Bonus de 8 500 euros\nPrise en charge à 100% des frais de transports\nRestaurants d’entreprise, Tickets resto\nCatalogue de formation +100 formation ouvert à l'ensemble des salariés ou chacun peut s'inscrire librement.\nSuivez nous et retrouvez tous nos postes et notre actualité sur\nhttps://www.linkedin.com/company/mindset.fr/"
  },
  {
    "title": "Senior Dev Lead - Paris (75) - Indeed.com",
    "job_title": "Senior Dev Lead",
    "jk": "c32c717b3b59386e",
    "company": "Criteo",
    "location": "Paris (75)",
    "canonical": "https://fr.indeed.com/viewjob?jk=c32c717b3b59386e",
    "contract": null,
    "description": "What You'll Do:\nAs a Dev Lead on Retail Media Onsite Campaigns – Cross Product Team, you’ll lead solutions that empower advertisers to create and configure campaigns tailored for multi-retailer and fast-track streams.\nAs part of the broader Onsite Campaign group, you will contribute to high-impact initiatives that elevate Retail Media to its next stage of maturity.\nYou'll lead and develop web applications—introducing new workflows, enhancing usability, and actively contributing to the design and implementation of full-stack features.\nCollaborate closely with Product and UX to shape new features, design solutions, and plan smooth rollouts.\nAlign product and customer priorities with operational and technical requirements.\nEnsure high-quality, maintainable, and scalable code.\nDrive technical decisions and help define the architecture of both new and existing features.\nWho You Are:\nBS in Software Engineering or equivalent practical experience\n5+ years of programming experience with strong proficiency in at least one of C#, Java, or Scala, and a solid understanding of RESTful APIs and microservices\nPrior experience managing an engineering team is a plus\nFamiliarity with front-end frameworks like Angular or React is a plus\nStrong communication and collaboration skills; able to navigate and build connections across distributed teams and functions\nProduct-minded: dedicated to delivering exceptional customer experiences\nCommitted to quality through sound design principles, automated testing, and thorough documentation\nPassionate about shipping performant, reliable software\nSelf-starter with a strong sense of ownership and accountability\nA clear communicator and dependable team player\nWe acknowledge that many candidates may not meet every single role requirement listed above. If your experience looks a little different from our requirements but you believe that you can still bring value to the role, we’d love to see your application!\nWho We Are:\nCriteo is a leader in commerce media, helping brands, agencies, and publishers create meaningful consumer connections through AI-powered advertising solutions. We’re shaping a more open and sustainable digital future for advertising.\nAt Criteo, our culture is as unique as it is diverse. From our offices across the globe or from the comfort of home, our 3,600 Criteos collaborate together to build an open, impactful, and forward-thinking environment.\nWe foster a workplace where everyone is valued, and employment decisions are based solely on skills, qualifications, and business needs—never on non-job-related factors or legally protected characteristics.\nWhat We Offer:\nWays of working – Our hybrid model blends home with in-office experiences, making space for both.\nGrow with us – Learning, mentorship & career development programs.\nYour wellbeing matters – Health benefits, wellness perks & mental health support.\nA team that cares – Diverse, inclusive, and globally connected.\nFair pay & perks – Attractive salary, with performance-based rewards and family-friendly policies, plus the potential for equity depending on role and level.\nAdditional benefits may vary depending on the country where you work and the nature of your employment with Criteo."
  },
  {
    "title": "Développeur Fullstack Angular / Java J2EE H/F - Gennevilliers (92) - Indeed.com",
    "job_title": "Développeur Fullstack Angular / Java J2EE H/F",
    "jk": "9234e8061ebf76f3",
    "company": "GEODIS",
    "location": "Gennevilliers (92)",
    "canonical": "https://fr.indeed.com/viewjob?jk=9234e8061ebf76f3",
    "contract": "CDI",
    "description": "<div>\n <h2 class=\"jobSectionHeader\"><b>Informations générales </b></h2>\n <div></div>\n <div>\n  <div>\n   <h3 class=\"jobSectionHeader\"><b>Entité de rattachement </b></h3>GEODIS est un leader mondial du transport et de la logistique, reconnu pour son expertise sur l'ensemble de la supply chain. Partenaire de croissance de ses clients, GEODIS intervient sur cinq métiers : l'optimisation de la chaîne d'approvisionnement, le Freight Forwarding, la logistique contractuelle, la distribution &amp; l'express et le transport routier. Avec un réseau mondial couvrant près de 166 pays et plus de 49 720 collaborateurs, GEODIS se classe au sixième rang mondial de son secteur. En 2024, GEODIS a réalisé un chiffre d'affaires de 11,3 milliards d'euros. GEODIS est une société du groupe SNCF. <br> A compétences égales, une attention particulière sera accordée aux candidatures des personnes en situation de handicap.\n  </div>\n  <div>\n   <h3 class=\"jobSectionHeader\"><b>Référence </b></h3>2023-11138\n  </div>\n </div>\n <h3 class=\"jobSectionHeader\"><b>Line Of Business </b></h3>\n <p>DISTRIBUTION &amp; EXPRESS</p>\n <h2 class=\"jobSectionHeader\"><b> Description du poste</b></h2>\n <h3 class=\"jobSectionHeader\"><b> Type de contrat </b></h3>\n <p>CDI-Temps plein</p>\n <h3 class=\"jobSectionHeader\"><b> Fonction </b></h3>\n <p>Fonctions Supports - Informatique</p>\n <h3 class=\"jobSectionHeader\"><b> Intitulé du poste </b></h3>\n <p>Développeur Fullstack Angular / Java J2EE H/F</p>\n <h3 class=\"jobSectionHeader\"><b> Description de la mission </b></h3>\n <div>\n  Intégré(e) au sein de la Dev Factory du siège de Distribution &amp; Express du groupe GEODIS, vous aurez pour mission principale de porter la vision technique du produit. <br> <br> Rattaché(e) au Lead Développeur, vos principales missions seront : <br>\n  <ul>\n   <li>Analyser les besoins et les contraintes techniques.</li>\n   <li>Participer à la rédaction des spécifications.</li>\n   <li>Réaliser le développement et la documentation associée.</li>\n   <li>Réaliser les tests unitaires et d'intégration.</li>\n   <li>Analyser les anomalies de recette et de production.</li>\n   <li>Réaliser la maintenance.</li>\n   <li>Réaliser les tests et valider la correction.</li>\n   <li>Vérifier que le livrable est conforme au besoin.</li>\n  </ul>\n </div>\n <h3 class=\"jobSectionHeader\"><b>Profil du candidat </b></h3>\n <p>De formation Bac+ 3 ou + 4 vous êtes motivé(e) et enthousiaste. Vous disposez d'au moins 5 ans d'expérience en développement d'applications et vous maîtrisez Java J2EE et Angular. Vous aimez travailler en équipe avec des cultures Agile et Craftsmanship. Autonome, organisé(e) et déterminé(e), vous disposez d'un bon esprit d'analyse et vous êtes fan de l'amélioration continue avec un esprit positif. Vous aimez être challengés et sortir de votre zone de confort.</p>\n <h3 class=\"jobSectionHeader\"><b> Temps de travail en % </b></h3>\n <p>100</p>\n <h2 class=\"jobSectionHeader\"><b> Lieu de prise de service </b></h2>\n <h3 class=\"jobSectionHeader\"><b>Lieu de prise de service </b></h3>\n <p>Europe, France, Île-de-France, Hauts-de-Seine</p>\n <h3 class=\"jobSectionHeader\"><b> Ville(s) </b></h3>\n <p></p>\n <div>\n  Gennevilliers\n </div>\n <p></p>\n <h2 class=\"jobSectionHeader\"><b> Critères candidat</b></h2>\n <h3 class=\"jobSectionHeader\"><b> Niveau d'études min. requis </b></h3>\n <p>BAC+4 / MAITRISE / MASTER(1)</p>\n <h3 class=\"jobSectionHeader\"><b> Niveau d'expérience dans la fonction </b></h3>\n <p>Confirmé (5 à 10 ans d'expérience)</p>\n <h3 class=\"jobSectionHeader\"><b> Langues </b></h3>\n <p>Anglais (Intermediaire)</p>\n</div>"
  }
]